[
    {
        "country": "Afghanistan",
        "dishes": [
            {
                "name": "Kabuli Pulao",
                "description": "Kabuli Pulao is a fragrant rice dish cooked with lamb, raisins, and carrots, often garnished with nuts and served on special occasions."
            },
            {
                "name": "Mantu",
                "description": "Mantu are steamed dumplings filled with spiced meat, typically served with a garlic-yogurt sauce and a sprinkle of dried mint."
            },
            {
                "name": "Ashak",
                "description": "Ashak are dumplings filled with leeks, topped with a garlic-yogurt sauce and a ground meat tomato sauce, and garnished with dried mint."
            }
        ],
        "dessert": {
            "name": "Sheer Khurma",
            "description": "Sheer Khurma is a rich vermicelli pudding made with milk, dates, nuts, and flavored with cardamom, often enjoyed during festive occasions."
        }
    },
    {
        "country": "Albania",
        "dishes": [
            {
                "name": "Tavë Kosi",
                "description": "Tavë Kosi is a baked dish featuring tender lamb and a tangy yogurt sauce, creating a creamy and savory flavor combination."
            },
            {
                "name": "Fërgesë",
                "description": "Fërgesë is a savory dish made with bell peppers, tomatoes, and cottage cheese, baked until bubbly and delicious."
            },
            {
                "name": "Byrek",
                "description": "Byrek is a savory pastry made with thin layers of dough filled with ingredients such as spinach, cheese, or meat."
            }
        ],
        "dessert": {
            "name": "Baklava",
            "description": "Baklava is a sweet pastry made with layers of filo dough, filled with nuts, and soaked in a sweet syrup, enjoyed for its rich and flaky texture."
        }
    },
    {
        "country": "Algeria",
        "dishes": [
            {
                "name": "Couscous",
                "description": "Couscous is a steamed semolina dish served with meat and vegetables, often accompanied by a flavorful broth or sauce."
            },
            {
                "name": "Chakchouka",
                "description": "Chakchouka is a hearty stew made with tomatoes, peppers, onions, and spices, often topped with poached eggs."
            },
            {
                "name": "Mechoui",
                "description": "Mechoui is a dish of roasted lamb, seasoned with aromatic spices, and traditionally cooked over an open flame."
            }
        ],
        "dessert": {
            "name": "Makroud",
            "description": "Makroud is a semolina cake filled with dates or nuts, soaked in honey or syrup, and enjoyed for its sweet and sticky texture."
        }
    },
    {
        "country": "Andorra",
        "dishes": [
            {
                "name": "Escudella",
                "description": "Escudella is a hearty meat and vegetable stew, often considered the national dish of Andorra, perfect for warming up in the colder months."
            },
            {
                "name": "Trinxat",
                "description": "Trinxat is a delicious cabbage and potato pancake, typically flavored with garlic and bacon, and enjoyed as a comforting meal."
            },
            {
                "name": "Truites de Carreroles",
                "description": "Truites de Carreroles is an omelette made with wild mushrooms, offering a rich and earthy flavor that highlights local foraged ingredients."
            }
        ],
        "dessert": {
            "name": "Crema Catalana",
            "description": "Crema Catalana is a creamy custard dessert with a caramelized sugar topping, similar to crème brûlée, and beloved for its rich flavor."
        }
    },
    {
        "country": "Angola",
        "dishes": [
            {
                "name": "Moamba de Galinha",
                "description": "Moamba de Galinha is a flavorful chicken stew cooked with palm oil, okra, and spices, often served with rice or funge."
            },
            {
                "name": "Calulu",
                "description": "Calulu is a traditional Angolan stew made with fish or meat, vegetables, and often served with a side of cassava porridge."
            },
            {
                "name": "Funge",
                "description": "Funge is a smooth, starchy porridge made from cassava flour, commonly served as a side dish to accompany stews and sauces."
            }
        ],
        "dessert": {
            "name": "Cocada Amarela",
            "description": "Cocada Amarela is a sweet and creamy coconut pudding, popular in Angola for its delightful coconut flavor and rich texture."
        }
    },
    {
        "country": "Antigua and Barbuda",
        "dishes": [
            {
                "name": "Fungee and Pepperpot",
                "description": "Fungee and Pepperpot is a traditional dish combining cornmeal fungee and a hearty meat and vegetable stew, offering a taste of Antiguan comfort food."
            },
            {
                "name": "Ducana",
                "description": "Ducana is a sweet potato dumpling, often spiced and wrapped in banana leaves before being boiled or steamed, enjoyed for its sweet and savory taste."
            },
            {
                "name": "Saltfish and Dumplings",
                "description": "Saltfish and Dumplings is a popular dish made with salted fish and boiled dumplings, providing a satisfying and flavorful meal."
            }
        ],
        "dessert": {
            "name": "Sugar Cake",
            "description": "Sugar Cake is a sweet coconut candy, made with grated coconut and sugar, and enjoyed for its chewy and delightful texture."
        }
    },
    {
        "country": "Argentina",
        "dishes": [
            {
                "name": "Asado",
                "description": "Asado is a traditional Argentine barbecue, featuring a variety of meats grilled to perfection and often enjoyed during social gatherings."
            },
            {
                "name": "Empanadas",
                "description": "Empanadas are savory pastries filled with meat, cheese, or vegetables, and baked or fried to create a delicious hand-held snack."
            },
            {
                "name": "Milanesa",
                "description": "Milanesa consists of breaded and fried meat cutlets, often served with a side of mashed potatoes or salad, and enjoyed for its crispy texture."
            }
        ],
        "dessert": {
            "name": "Dulce de Leche",
            "description": "Dulce de Leche is a creamy caramel spread made from sweetened milk, enjoyed on its own or as a filling in various desserts."
        }
    },
    {
        "country": "Armenia",
        "dishes": [
            {
                "name": "Khorovats",
                "description": "Khorovats is a traditional Armenian barbecue, featuring marinated and grilled meats, often enjoyed with fresh vegetables and lavash."
            },
            {
                "name": "Dolma",
                "description": "Dolma consists of grape leaves stuffed with a mixture of rice, meat, and herbs, offering a savory and aromatic flavor."
            },
            {
                "name": "Lavash",
                "description": "Lavash is a soft and thin flatbread, commonly served with various dips, meats, and cheeses, and enjoyed for its versatility."
            }
        ],
        "dessert": {
            "name": "Gata",
            "description": "Gata is a sweet bread filled with a buttery mixture of flour and sugar, often enjoyed with tea for its rich and sweet taste."
        }
    },
    {
        "country": "Australia",
        "dishes": [
            {
                "name": "Meat Pie",
                "description": "Meat Pie is a savory pie filled with minced meat, gravy, and sometimes vegetables, and is a beloved snack in Australia."
            },
            {
                "name": "Barramundi",
                "description": "Barramundi is a popular Australian fish, often grilled or pan-fried, and enjoyed for its mild and buttery flavor."
            },
            {
                "name": "Vegemite on Toast",
                "description": "Vegemite on Toast is a quintessential Australian breakfast, featuring a spread of savory yeast extract on toasted bread."
            }
        ],
        "dessert": {
            "name": "Pavlova",
            "description": "Pavlova is a meringue-based dessert topped with whipped cream and fresh fruits, known for its light and airy texture."
        }
    },
    {
        "country": "Austria",
        "dishes": [
            {
                "name": "Wiener Schnitzel",
                "description": "Wiener Schnitzel is a breaded and fried veal cutlet, traditionally served with a slice of lemon and potato salad."
            },
            {
                "name": "Tafelspitz",
                "description": "Tafelspitz is a classic Austrian dish of boiled beef, often served with root vegetables, horseradish, and chive sauce."
            },
            {
                "name": "Kaiserschmarrn",
                "description": "Kaiserschmarrn is a fluffy shredded pancake, often served with powdered sugar and fruit compote, enjoyed as a dessert or sweet meal."
            }
        ],
        "dessert": {
            "name": "Sachertorte",
            "description": "Sachertorte is a rich chocolate cake with a layer of apricot jam, traditionally served with a dollop of whipped cream."
        }
    },
    {
        "country": "Azerbaijan",
        "dishes": [
            {
                "name": "Plov",
                "description": "Plov is a fragrant rice pilaf cooked with saffron, meat, and vegetables, and is considered a national dish of Azerbaijan."
            },
            {
                "name": "Dolma",
                "description": "Dolma are grape leaves stuffed with a mixture of rice, meat, and herbs, creating a savory and aromatic flavor."
            },
            {
                "name": "Kebab",
                "description": "Kebab consists of marinated and grilled meat, often served with flatbread and fresh vegetables, and enjoyed for its smoky flavor."
            }
        ],
        "dessert": {
            "name": "Pakhlava",
            "description": "Pakhlava is a sweet pastry made with layers of filo dough, nuts, and honey, similar to baklava, and enjoyed for its rich taste."
        }
    },
    {
        "country": "Bahamas",
        "dishes": [
            {
                "name": "Conch Salad",
                "description": "Conch Salad is a refreshing dish made with raw conch, citrus juice, tomatoes, onions, and peppers, offering a zesty and tangy flavor."
            },
            {
                "name": "Cracked Conch",
                "description": "Cracked Conch is a dish of battered and fried conch meat, often served with dipping sauces and enjoyed for its crispy texture."
            },
            {
                "name": "Rock Lobster",
                "description": "Rock Lobster is a grilled lobster dish, often seasoned with spices and served with lemon or butter for a rich and flavorful meal."
            }
        ],
        "dessert": {
            "name": "Guava Duff",
            "description": "Guava Duff is a sweet pastry filled with guava, often served with a warm butter rum sauce, and enjoyed for its fruity flavor."
        }
    },
    {
        "country": "Bahrain",
        "dishes": [
            {
                "name": "Machboos",
                "description": "Machboos is a spiced rice dish cooked with meat or fish, flavored with saffron and a blend of aromatic spices."
            },
            {
                "name": "Samboosa",
                "description": "Samboosa are savory pastries filled with spiced meat or vegetables, and fried to a crispy perfection."
            },
            {
                "name": "Ghoozi",
                "description": "Ghoozi is a roasted lamb dish served with rice, nuts, and raisins, creating a rich and festive meal."
            }
        ],
        "dessert": {
            "name": "Halwa",
            "description": "Halwa is a sweet, jelly-like confection made with sugar, cornflour, and flavored with saffron and nuts, enjoyed for its unique texture."
        }
    },
    {
        "country": "Bangladesh",
        "dishes": [
            {
                "name": "Biryani",
                "description": "Biryani is a spiced rice dish cooked with meat, often featuring layers of fragrant basmati rice, tender meat, and aromatic spices."
            },
            {
                "name": "Hilsa Fish Curry",
                "description": "Hilsa Fish Curry is a traditional fish curry made with hilsa fish, cooked in a rich and spicy sauce, and enjoyed for its bold flavors."
            },
            {
                "name": "Panta Ilish",
                "description": "Panta Ilish is a dish of fermented rice served with fried hilsa fish, offering a unique combination of tangy and savory flavors."
            }
        ],
        "dessert": {
            "name": "Mishti Doi",
            "description": "Mishti Doi is a sweetened yogurt dessert, known for its creamy texture and delightful caramel-like flavor."
        }
    },
    {
        "country": "Barbados",
        "dishes": [
            {
                "name": "Cou-Cou and Flying Fish",
                "description": "Cou-Cou and Flying Fish is a national dish of Barbados, featuring cornmeal and okra served with seasoned flying fish."
            },
            {
                "name": "Pudding and Souse",
                "description": "Pudding and Souse is a pickled pork dish served with a spiced sweet potato pudding, offering a mix of tangy and savory flavors."
            },
            {
                "name": "Pepperpot",
                "description": "Pepperpot is a rich and flavorful meat stew, traditionally made with a variety of meats, vegetables, and spices."
            }
        ],
        "dessert": {
            "name": "Bajan Black Cake",
            "description": "Bajan Black Cake is a dense fruitcake made with dried fruits soaked in rum, enjoyed for its rich and festive flavor."
        }
    },
    {
        "country": "Belarus",
        "dishes": [
            {
                "name": "Draniki",
                "description": "Draniki are crispy potato pancakes, often served with sour cream or apple sauce, and enjoyed for their savory taste."
            },
            {
                "name": "Machanka",
                "description": "Machanka is a hearty pork stew, typically served with pancakes or bread, offering a rich and comforting meal."
            },
            {
                "name": "Kolduny",
                "description": "Kolduny are meat-filled potato dumplings, cooked until tender and often served with a savory sauce."
            }
        ],
        "dessert": {
            "name": "Syrniki",
            "description": "Syrniki are fried quark pancakes, enjoyed for their slightly sweet flavor and often served with honey or jam."
        }
    },
    {
        "country": "Belgium",
        "dishes": [
            {
                "name": "Moules-Frites",
                "description": "Moules-Frites is a classic Belgian dish featuring mussels cooked in a flavorful broth, served with crispy fries."
            },
            {
                "name": "Carbonnade Flamande",
                "description": "Carbonnade Flamande is a beef stew made with beer, onions, and spices, offering a rich and hearty flavor."
            },
            {
                "name": "Stoofvlees",
                "description": "Stoofvlees is a traditional beef stew, slow-cooked with beer and spices, and enjoyed for its tender meat and savory sauce."
            }
        ],
        "dessert": {
            "name": "Belgian Waffles",
            "description": "Belgian Waffles are light and crispy, often served with whipped cream, fresh fruits, and syrup."
        }
    },
    {
        "country": "Belize",
        "dishes": [
            {
                "name": "Rice and Beans",
                "description": "Rice and Beans is a staple dish in Belize, cooked with coconut milk and often served with stewed meats."
            },
            {
                "name": "Stewed Chicken",
                "description": "Stewed Chicken is a flavorful slow-cooked chicken dish, seasoned with a blend of spices and served with rice and beans."
            },
            {
                "name": "Fry Jacks",
                "description": "Fry Jacks are pieces of fried dough, often served as a breakfast item or snack, enjoyed for their soft and fluffy texture."
            }
        ],
        "dessert": {
            "name": "Cassava Pudding",
            "description": "Cassava Pudding is a traditional Belizean dessert, made from grated cassava, coconut milk, and spices, enjoyed for its sweet and moist texture."
        }
    },
    {
        "country": "Benin",
        "dishes": [
            {
                "name": "Kuli-Kuli",
                "description": "Kuli-Kuli are crunchy peanut snacks made from groundnuts, seasoned with spices, and deep-fried until golden brown, enjoyed for their nutty and savory flavor."
            },
            {
                "name": "Ago Glain",
                "description": "Ago Glain is a flavorful shrimp and vegetable stew, often cooked with tomatoes, peppers, and various spices, representing the rich culinary heritage of Benin."
            },
            {
                "name": "Yovo Doko",
                "description": "Yovo Doko are fried dough balls, similar to doughnuts, enjoyed for their sweet taste and crispy exterior."
            }
        ],
        "dessert": {
            "name": "Akassa",
            "description": "Akassa is a fermented corn dough, typically served with savory dishes, known for its slightly sour taste and smooth texture."
        }
    },
    {
        "country": "Bhutan",
        "dishes": [
            {
                "name": "Ema Datshi",
                "description": "Ema Datshi is a spicy stew made with chilies and cheese, often considered the national dish of Bhutan, enjoyed for its rich and fiery flavor."
            },
            {
                "name": "Phaksha Paa",
                "description": "Phaksha Paa is a dish of pork cooked with red chilies, radish, and sometimes spinach, offering a hearty and spicy meal."
            },
            {
                "name": "Jasha Maru",
                "description": "Jasha Maru is a spicy chicken stew, made with tomatoes, garlic, and ginger, enjoyed for its robust and aromatic flavors."
            }
        ],
        "dessert": {
            "name": "Suja",
            "description": "Suja is a traditional Bhutanese butter tea, known for its unique salty and buttery flavor, often enjoyed during social and religious occasions."
        }
    },
    {
        "country": "Bolivia",
        "dishes": [
            {
                "name": "Salteñas",
                "description": "Salteñas are savory pastries filled with meat, potatoes, peas, and a slightly sweet and spicy sauce, enjoyed as a popular snack or meal in Bolivia."
            },
            {
                "name": "Pique Macho",
                "description": "Pique Macho is a hearty stir-fry made with beef, sausages, potatoes, and vegetables, often served with a spicy sauce."
            },
            {
                "name": "Anticuchos",
                "description": "Anticuchos are skewers of marinated and grilled beef heart, traditionally served with potatoes and a spicy peanut sauce."
            }
        ],
        "dessert": {
            "name": "Tikvenik",
            "description": "Tikvenik is a pumpkin strudel with a sweet pumpkin filling wrapped in thin, flaky pastry, enjoyed especially during the autumn and winter seasons in Bulgaria."
        }
    },
    {
        "country": "Bosnia and Herzegovina",
        "dishes": [
            {
                "name": "Ćevapi",
                "description": "Ćevapi are grilled minced meat sausages, typically served with flatbread, onions, and a red pepper spread called ajvar."
            },
            {
                "name": "Burek",
                "description": "Burek is a savory pastry made with thin layers of dough and filled with meat, cheese, or spinach, enjoyed for its flaky and flavorful texture."
            },
            {
                "name": "Bosanski Lonac",
                "description": "Bosanski Lonac is a traditional meat and vegetable stew, slow-cooked to blend the rich flavors of beef, cabbage, potatoes, and carrots."
            }
        ],
        "dessert": {
            "name": "Tufahija",
            "description": "Tufahija is a dessert of poached apples stuffed with walnuts and sugar, often served in syrup and enjoyed for its sweet and aromatic taste."
        }
    },
    {
        "country": "Botswana",
        "dishes": [
            {
                "name": "Seswaa",
                "description": "Seswaa is a traditional dish of pounded meat, usually beef or goat, slow-cooked with salt and served with maize porridge or rice."
            },
            {
                "name": "Morogo",
                "description": "Morogo is a dish made with wild spinach or leafy greens, often cooked with onions and tomatoes, and served as a nutritious side dish."
            },
            {
                "name": "Vetkoek",
                "description": "Vetkoek is a type of fried dough bread, often filled with meat or jam, enjoyed for its soft and fluffy texture."
            }
        ],
        "dessert": {
            "name": "Dikgobe",
            "description": "Dikgobe is a dish of beans and cornmeal, cooked together to create a hearty and flavorful meal, enjoyed for its rich taste and texture."
        }
    },
    {
        "country": "Brazil",
        "dishes": [
            {
                "name": "Feijoada",
                "description": "Feijoada is a black bean stew with various cuts of pork, often served with rice, collard greens, and orange slices, enjoyed for its hearty and rich flavor."
            },
            {
                "name": "Churrasco",
                "description": "Churrasco refers to Brazilian barbecue, featuring a variety of grilled meats, often seasoned simply with salt and enjoyed for their smoky flavor."
            },
            {
                "name": "Moqueca",
                "description": "Moqueca is a flavorful fish stew made with coconut milk, tomatoes, onions, and palm oil, enjoyed for its creamy and aromatic taste."
            }
        ],
        "dessert": {
            "name": "Brigadeiro",
            "description": "Brigadeiro are chocolate truffles made with condensed milk, cocoa powder, and butter, rolled in chocolate sprinkles, and enjoyed for their rich and fudgy texture."
        }
    },
    {
        "country": "Brunei",
        "dishes": [
            {
                "name": "Ambuyat",
                "description": "Ambuyat is a dish made from sago starch, served with various side dishes and dipping sauces, known for its unique texture and taste."
            },
            {
                "name": "Nasi Katok",
                "description": "Nasi Katok is a simple yet popular dish of rice served with fried chicken and a spicy sambal sauce."
            },
            {
                "name": "Hati Buyah",
                "description": "Hati Buyah is a dish of beef lung cooked in soy sauce, enjoyed for its rich and savory flavor."
            }
        ],
        "dessert": {
            "name": "Kuih Cincin",
            "description": "Kuih Cincin are ring-shaped cookies made with rice flour and palm sugar, enjoyed for their sweet taste and crunchy texture."
        }
    },
    {
        "country": "Bulgaria",
        "dishes": [
            {
                "name": "Banitsa",
                "description": "Banitsa is a cheese-filled pastry made with layers of filo dough and a mixture of eggs and cheese, enjoyed for its flaky and savory taste."
            },
            {
                "name": "Shopska Salad",
                "description": "Shopska Salad is a fresh salad made with tomatoes, cucumbers, peppers, onions, and feta cheese, dressed with olive oil and vinegar."
            },
            {
                "name": "Kavarma",
                "description": "Kavarma is a slow-cooked stew made with meat, usually pork or chicken, and vegetables, seasoned with spices and herbs."
            }
        ],
        "dessert": {
            "name": "Baklava",
            "description": "Baklava is a sweet pastry made with layers of filo dough, filled with nuts, and soaked in syrup, enjoyed for its rich and sweet flavor."
        }
    },
    {
        "country": "Burkina Faso",
        "dishes": [
            {
                "name": "Riz Gras",
                "description": "Riz Gras is a flavorful rice dish cooked with vegetables and meat, often seasoned with tomatoes and spices."
            },
            {
                "name": "Babenda",
                "description": "Babenda is a dish made with fermented beans and leafy greens, offering a unique blend of tangy and savory flavors."
            },
            {
                "name": "Poulet Bicyclette",
                "description": "Poulet Bicyclette is a grilled chicken dish, known for its tender meat and crispy skin, often marinated with local spices."
            }
        ],
        "dessert": {
            "name": "Degue",
            "description": "Degue is a dessert made with millet couscous and yogurt, often sweetened and flavored with vanilla or citrus."
        }
    },
    {
        "country": "Burundi",
        "dishes": [
            {
                "name": "Ndizi na Nyama",
                "description": "Ndizi na Nyama is a dish of plantains cooked with meat, creating a savory and sweet combination of flavors."
            },
            {
                "name": "Boko Boko Harees",
                "description": "Boko Boko Harees is a chicken porridge, slow-cooked with spices and grains to create a comforting and hearty meal."
            },
            {
                "name": "Ugali",
                "description": "Ugali is a staple maize porridge, often served as a side dish to stews and soups."
            }
        ],
        "dessert": {
        "name": "Beignets","description": "Beignets are fried dough balls, enjoyed for their sweet taste and crispy exterior, often dusted with powdered sugar."
        }
    },
    {
        "country": "Cambodia",
        "dishes": [
            {
                "name": "Amok Trey",
                "description": "Amok Trey is a fish curry steamed in banana leaves, made with coconut milk and spices, known for its rich and aromatic flavor."
            },
            {
                "name": "Lok Lak",
                "description": "Lok Lak is a stir-fried beef dish, often served with rice, salad, and a tangy lime and pepper dipping sauce."
            },
            {
                "name": "Bai Sach Chrouk",
                "description": "Bai Sach Chrouk is a simple yet flavorful dish of grilled pork served over rice, often accompanied by pickled vegetables and a garlic sauce."
            }
        ],
        "dessert": {
            "name": "Num Ansom Chek",
            "description": "Num Ansom Chek is a sticky rice cake filled with bananas, wrapped in banana leaves and steamed to create a sweet and chewy dessert."
        }
    },
    {
        "country": "Cameroon",
        "dishes": [
            {
                "name": "Ndolé",
                "description": "Ndolé is a bitterleaf soup cooked with meat or fish, often combined with peanuts to create a rich and hearty flavor."
            },
            {
                "name": "Poulet DG",
                "description": "Poulet DG is a dish of chicken cooked with plantains, vegetables, and spices, known for its flavorful and aromatic taste."
            },
            {
                "name": "Ekwang",
                "description": "Ekwang is a dish made with grated cocoyam wrapped in leaves, cooked with palm oil and spices to create a savory and rich flavor."
            }
        ],
        "dessert": {
            "name": "Puff-Puff",
            "description": "Puff-Puff are fried dough balls, enjoyed for their sweet taste and soft, airy texture."
        }
    },
    {
        "country": "Canada",
        "dishes": [
            {
                "name": "Poutine",
                "description": "Poutine is a dish of fries topped with cheese curds and gravy, enjoyed for its rich and savory flavor."
            },
            {
                "name": "Tourtière",
                "description": "Tourtière is a meat pie made with minced pork or beef, seasoned with spices and herbs, often enjoyed during festive occasions."
            },
            {
                "name": "Butter Tarts",
                "description": "Butter Tarts are sweet pastries with a buttery filling made from sugar, eggs, and butter, known for their rich and gooey texture."
            }
        ],
        "dessert": {
            "name": "Nanaimo Bars",
            "description": "Nanaimo Bars are a layered dessert with a base of wafer crumbs, a middle layer of custard-flavored butter icing, and a top layer of chocolate."
        }
    },
    {
        "country": "Cape Verde",
        "dishes": [
            {
                "name": "Cachupa",
                "description": "Cachupa is a slow-cooked stew of corn, beans, and either fish or meat, known for its hearty and comforting flavor."
            },
            {
                "name": "Pastel",
                "description": "Pastel is a deep-fried pastry filled with a variety of ingredients such as fish or cheese, enjoyed for its crispy texture."
            },
            {
                "name": "Buzio",
                "description": "Buzio is a conch stew, cooked with spices and vegetables, offering a rich and flavorful taste."
            }
        ],
        "dessert": {
            "name": "Pudim de Queijo",
            "description": "Pudim de Queijo is a cheese pudding, known for its smooth and creamy texture, often enjoyed as a sweet treat."
        }
    },
    {
        "country": "Central African Republic",
        "dishes": [
            {
                "name": "Muamba de Galinha",
                "description": "Muamba de Galinha is a chicken dish cooked in palm oil with spices, offering a rich and flavorful taste."
            },
            {
                "name": "Kanda",
                "description": "Kanda are meatballs cooked with greens and spices, known for their savory and aromatic flavor."
            },
            {
                "name": "Brochettes",
                "description": "Brochettes are grilled meat skewers, often marinated with spices and enjoyed for their smoky and savory taste."
            }
        ],
        "dessert": {
            "name": "Banana Fritters",
            "description": "Banana Fritters are fried pieces of banana, often sweetened and enjoyed for their crispy exterior and soft interior."
        }
    },
    {
        "country": "Chad",
        "dishes": [
            {
                "name": "Boule",
                "description": "Boule is a type of millet or sorghum porridge, often served with various stews and enjoyed for its smooth texture."
            },
            {
                "name": "Daraba",
                "description": "Daraba is an okra and tomato stew, known for its rich and tangy flavor."
            },
            {
                "name": "Jarret de Boeuf",
                "description": "Jarret de Boeuf is a beef stew, slow-cooked with vegetables and spices, offering a hearty and comforting meal."
            }
        ],
        "dessert": {
            "name": "Kisra",
            "description": "Kisra are thin sorghum crepes, often enjoyed as a sweet treat or a savory side dish."
        }
    },
    {
        "country": "Chile",
        "dishes": [
            {
                "name": "Empanadas",
                "description": "Empanadas are filled pastries, often stuffed with meat, cheese, or seafood, and baked or fried to create a delicious snack."
            },
            {
                "name": "Cazuela",
                "description": "Cazuela is a meat and vegetable stew, often made with beef or chicken, potatoes, corn, and pumpkin, enjoyed for its rich and comforting flavor."
            },
            {
                "name": "Pastel de Choclo",
                "description": "Pastel de Choclo is a corn pie, made with a layer of ground meat, olives, and hard-boiled eggs, topped with a sweet corn mixture and baked to perfection."
            }
        ],
        "dessert": {
            "name": "Tres Leches Cake",
            "description": "Tres Leches Cake is a sponge cake soaked in three kinds of milk (evaporated, condensed, and whole milk), known for its moist and rich texture."
        }
    },
    {
        "country": "China",
        "dishes": [
            {
                "name": "Peking Duck",
                "description": "Peking Duck is a roasted duck dish, known for its crispy skin and tender meat, often served with pancakes, scallions, and hoisin sauce."
            },
            {
                "name": "Sweet and Sour Pork",
                "description": "Sweet and Sour Pork is a popular dish featuring fried pork pieces coated in a tangy and sweet sauce, often served with vegetables."
            },
            {
                "name": "Xiaolongbao",
                "description": "Xiaolongbao are soup dumplings, filled with meat and broth, enjoyed for their delicate texture and flavorful filling."
            }
        ],
        "dessert": {
            "name": "Mooncake",
            "description": "Mooncake is a traditional pastry with various fillings such as lotus seed paste, red bean paste, or salted egg yolk, enjoyed during the Mid-Autumn Festival."
        }
    },
    {
        "country": "Colombia",
        "dishes": [
            {
                "name": "Arepas",
                "description": "Arepas are corn cakes, often grilled or fried, and stuffed with cheese, meats, or avocado, enjoyed for their versatility and delicious taste."
            },
            {
                "name": "Bandeja Paisa",
                "description": "Bandeja Paisa is a hearty platter featuring a variety of ingredients such as grilled meat, beans, rice, plantains, avocado, and a fried egg."
            },
            {
                "name": "Ajiaco",
                "description": "Ajiaco is a chicken and potato soup, flavored with corn, herbs, and often served with capers and cream, known for its comforting and rich taste."
            }
        ],
        "dessert": {
            "name": "Arroz con Leche",
            "description": "Arroz con Leche is a creamy rice pudding, sweetened with sugar and flavored with cinnamon, enjoyed as a comforting dessert."
        }
    },
    {
        "country": "Comoros",
        "dishes": [
            {
                "name": "Langouste a la Vanille",
                "description": "Langouste a la Vanille is a dish of lobster cooked with a vanilla sauce, offering a unique and aromatic flavor."
            },
            {
                "name": "Mkatra Foutra",
                "description": "Mkatra Foutra is a type of coconut bread, enjoyed for its soft texture and subtle coconut flavor."
            },
            {
                "name": "Pilao",
                "description": "Pilao is a spiced rice dish, often cooked with meat or fish, and flavored with a blend of spices, creating a rich and aromatic taste."
            }
        ],
        "dessert": {
            "name": "Coconut Cake",
            "description": "Coconut Cake is a sweet dessert made with grated coconut, enjoyed for its moist and flavorful texture."
        }
    },
    {
        "country": "Congo, Democratic Republic of the",
        "dishes": [
            {
                "name": "Moambe Chicken",
                "description": "Moambe Chicken is a dish of chicken cooked in a rich palm nut sauce, known for its hearty and flavorful taste."
            },
            {
                "name": "Pondu",
                "description": "Pondu is a cassava leaf stew, often cooked with palm oil and fish, enjoyed for its savory and aromatic flavor."
            },
            {
                "name": "Fufu",
                "description": "Fufu is a dough-like staple made from cassava, yams, or plantains, often served as an accompaniment to soups and stews."
            }
        ],
        "dessert": {
            "name": "Mikate",
            "description": "Mikate are fried dough balls, enjoyed for their sweet taste and crispy texture."
        }
    },
    {
        "country": "Congo, Republic of the",
        "dishes": [
            {
                "name": "Saka-Saka",
                "description": "Saka-Saka is a dish made from cassava leaves, cooked with palm oil and spices, known for its rich and savory flavor."
            },
            {
                "name": "Mbala Pinda",
                "description": "Mbala Pinda is a dish made with peanuts and cassava, offering a unique combination of nutty and starchy flavors."
            },
            {
                "name": "Ntaba",
                "description": "Ntaba is grilled goat meat, often marinated with spices and enjoyed for its smoky and tender texture."
            }
        ],
        "dessert": {
            "name": "Beignet",
            "description": "Beignet is a fried dough, enjoyed for its sweet taste and crispy exterior, often dusted with powdered sugar."
        }
    },
    {
        "country": "Costa Rica",
        "dishes": [
            {
                "name": "Gallo Pinto",
                "description": "Gallo Pinto is a traditional dish of rice and beans, often flavored with onions, peppers, and cilantro, enjoyed for its hearty and savory taste."
            },
            {
                "name": "Casado",
                "description": "Casado is a meal featuring rice, beans, plantains, salad, and a choice of meat, offering a balanced and flavorful combination."
            },
            {
                "name": "Sopa Negra",
                "description": "Sopa Negra is a black bean soup, often served with a poached egg and flavored with garlic and cilantro."
            }
        ],
        "dessert": {
            "name": "Tres Leches Cake",
            "description": "Tres Leches Cake is a sponge cake soaked in three kinds of milk (evaporated, condensed, and whole milk), known for its moist and rich texture."
        }
    },
    {
        "country": "Croatia",
        "dishes": [
            {
                "name": "Peka",
                "description": "Peka is a traditional dish where meat and vegetables are cooked under a bell-like lid, creating a tender and flavorful meal."
            },
            {
                "name": "Pašticada",
                "description": "Pašticada is a slow-cooked beef stew, marinated and cooked with red wine and prunes, known for its rich and aromatic flavor."
            },
            {
                "name": "Crni Rižot",
                "description": "Crni Rižot is a black risotto made with cuttlefish or squid, flavored with their ink, creating a unique and savory taste."
            }
        ],
        "dessert": {
            "name": "Fritule",
            "description": "Fritule are small fried dough balls, often flavored with rum and citrus zest, enjoyed for their sweet and aromatic taste."
        }
    },
    {
        "country": "Cuba",
        "dishes": [
            {
                "name": "Ropa Vieja",
                "description": "Ropa Vieja is a dish of shredded beef cooked in a tomato-based sauce with peppers and onions, enjoyed for its tender and flavorful taste."
            },
            {
                "name": "Moros y Cristianos",
                "description": "Moros y Cristianos is a dish of rice and black beans, often flavored with garlic, onions, and spices, enjoyed for its hearty and savory flavor."
            },
            {
                "name": "Lechón Asado",
                "description": "Lechón Asado is roast pork, typically marinated with a blend of citrus and spices, enjoyed for its tender and juicy texture."
            }
        ],
        "dessert": {
            "name": "Flan",
            "description": "Flan is a caramel custard dessert, known for its smooth and creamy texture, often topped with a layer of caramel sauce."
        }
    },
    {
        "country": "Cyprus",
        "dishes": [
            {
                "name": "Souvlaki",
                "description": "Souvlaki are grilled meat skewers, often served with pita bread and a variety of accompaniments such as tzatziki and salad."
            },
            {
                "name": "Halloumi Cheese",
                "description": "Halloumi Cheese is a semi-hard cheese often grilled or fried, enjoyed for its salty flavor and squeaky texture."
            },
            {
                "name": "Moussaka",
                "description": "Moussaka is a casserole made with layers of eggplant, ground meat, and béchamel sauce, baked until golden and enjoyed for its rich and comforting taste."
            }
        ],
        "dessert": {
            "name": "Loukoumades",
            "description": "Loukoumades are fried dough balls drizzled with honey and often sprinkled with cinnamon or nuts, enjoyed for their sweet and sticky texture."
        }
    },
    {
        "country": "Czech Republic",
        "dishes": [
            {
                "name": "Svíčková",
                "description": "Svíčková is marinated beef served with a creamy vegetable sauce, often accompanied by dumplings and cranberry sauce."
            },
            {
                "name": "Vepřo Knedlo Zelo",
                "description": "Vepřo Knedlo Zelo is a traditional dish of roast pork served with dumplings and sauerkraut, enjoyed for its hearty and savory flavor."
            },
            {
                "name": "Goulash",
                "description": "Goulash is a rich meat stew, typically made with beef, onions, and paprika, enjoyed for its warming and hearty taste."
            }
        ],
        "dessert": {
            "name": "Trdelník",
            "description": "Trdelník is a sweet pastry made from rolled dough, coated with sugar and walnuts, and roasted over an open flame."
        }
    },
    {
        "country": "Denmark",
        "dishes": [
            {
                "name": "Smørrebrød",
                "description": "Smørrebrød are open-faced sandwiches, typically made with rye bread and topped with a variety of ingredients such as fish, meats, and cheeses."
            },
            {
                "name": "Frikadeller",
                "description": "Frikadeller are Danish meatballs, often made with pork and served with potatoes and gravy."
            },
            {
                "name": "Stegt Flæsk",
                "description": "Stegt Flæsk is a dish of crispy pork served with potatoes and parsley sauce, enjoyed for its rich and savory flavor."
            }
        ],
        "dessert": {
            "name": "Æbleskiver",
            "description": "Æbleskiver are round pancake balls, often served with powdered sugar and jam, enjoyed for their light and fluffy texture."
        }
    },
    {
        "country": "Djibouti",
        "dishes": [
            {
                "name": "Skoudehkaris",
                "description": "Skoudehkaris is a spiced rice dish with meat, often flavored with a blend of spices and enjoyed for its rich and aromatic taste."
            },
            {
                "name": "Fah-fah",
                "description": "Fah-fah is a meat and vegetable soup, known for its hearty and comforting flavor."
            },
            {
                "name": "Yetakelt W'et",
                "description": "Yetakelt W'et is a spicy vegetable stew, often made with a variety of vegetables and seasoned with berbere spice."
            }
        ],
        "dessert": {
            "name": "Halwa",
            "description": "Halwa is a sweet confection made with sugar, ghee, and sometimes nuts or spices, enjoyed for its rich and smooth texture."
        }
    },
    {
        "country": "Dominica",
        "dishes": [
            {
                "name": "Mountain Chicken",
                "description": "Mountain Chicken refers to frog legs, often cooked with a blend of spices and enjoyed for their tender and flavorful meat."
            },
            {
                "name": "Callaloo Soup",
                "description": "Callaloo Soup is a leafy green soup, typically made with callaloo leaves, coconut milk, and various spices, enjoyed for its rich and creamy taste."
            },
            {
                "name": "Crab Backs",
                "description": "Crab Backs are stuffed crab shells, often filled with a mixture of crab meat, spices, and breadcrumbs, baked to perfection."
            }
        ],
        "dessert": {
            "name": "Cassava Pone",
            "description": "Cassava Pone is a cassava cake, known for its moist and dense texture, often flavored with coconut and spices."
        }
    },
    {
        "country": "Dominican Republic",
        "dishes": [
            {
                "name": "La Bandera",
                "description": "La Bandera is a traditional dish consisting of rice, beans, and meat, often accompanied by a side of salad or plantains."
            },
            {
                "name": "Sancocho",
                "description": "Sancocho is a hearty meat and vegetable stew, often made with a variety of meats and root vegetables, enjoyed for its rich and comforting flavor."
            },
            {
                "name": "Mangu",
                "description": "Mangu is a dish of mashed plantains, often served with onions, cheese, and sometimes eggs, enjoyed for its savory and smooth texture."
            }
        ],
        "dessert": {
            "name": "Flan",
            "description": "Flan is a caramel custard dessert, known for its smooth and creamy texture, often topped with a layer of caramel sauce."
        }
    },
    {
        "country": "East Timor (Timor-Leste)",
        "dishes": [
            {
                "name": "Ikan Pepes",
                "description": "Ikan Pepes is a dish of fish wrapped in banana leaves and grilled, often seasoned with a blend of spices and herbs."
            },
            {
                "name": "Batar Daan",
                "description": "Batar Daan is a stew made with corn, mung beans, and pumpkin, offering a hearty and nutritious meal."
            },
            {
                "name": "Tukir",
                "description": "Tukir is a chicken curry, made with a blend of spices and coconut milk, enjoyed for its rich and aromatic flavor."
            }
        ],
        "dessert": {
            "name": "Bibinka",
            "description": "Bibinka is a layered coconut cake, known for its sweet and rich flavor, often enjoyed as a festive treat."
        }
    },
    {
        "country": "Ecuador",
        "dishes": [
            {
                "name": "Ceviche",
                "description": "Ceviche is a marinated seafood salad, typically made with fish or shrimp, and flavored with lime, onions, and cilantro."
            },
            {
                "name": "Llapingachos",
                "description": "Llapingachos are potato patties stuffed with cheese, often served with a peanut sauce and enjoyed for their crispy exterior and soft interior."
            },
            {
                "name": "Seco de Chivo",
                "description": "Seco de Chivo is a goat stew, slow-cooked with a blend of spices and herbs, enjoyed for its tender and flavorful meat."
            }
        ],
        "dessert": {
            "name": "Espumillas",
            "description": "Espumillas are meringue desserts, often flavored with fruit puree and enjoyed for their light and airy texture."
        }
    },
    {
        "country": "Egypt",
        "dishes": [
            {
                "name": "Koshari",
                "description": "Koshari is a dish of rice, lentils, and pasta, topped with a spicy tomato sauce and crispy onions, enjoyed for its hearty and satisfying flavor."
            },
            {
                "name": "Ful Medames",
                "description": "Ful Medames is a dish of stewed fava beans, often flavored with garlic, lemon, and olive oil, and enjoyed as a nutritious and filling meal."
            },
            {
                "name": "Molokhia",
                "description": "Molokhia is a stew made with jute leaves, often cooked with chicken or rabbit, and enjoyed for its unique and savory flavor."
            }
        ],
        "dessert": {
            "name": "Basbousa",
            "description": "Basbousa is a semolina cake soaked in syrup, often flavored with coconut or almonds, enjoyed for its sweet and moist texture."
        }
    },
    {
        "country": "El Salvador",
        "dishes": [
            {
                "name": "Pupusas",
                "description": "Pupusas are stuffed corn tortillas, often filled with cheese, beans, or meat, and enjoyed for their savory and satisfying taste."
            },
            {
                "name": "Sopa de Pata",
                "description": "Sopa de Pata is a tripe soup, often made with vegetables and spices, enjoyed for its hearty and flavorful broth."
            },
            {
                "name": "Yuca Frita",
                "description": "Yuca Frita is fried cassava, often served with a tangy dipping sauce, enjoyed for its crispy exterior and soft interior."
            }
        ],
        "dessert": {
            "name": "Quesadilla Salvadorena",
            "description": "Quesadilla Salvadorena is a sweet cheese bread, known for its rich and moist texture, often enjoyed with coffee."
        }
    },
    {
        "country": "Equatorial Guinea",
        "dishes": [
            {
                "name": "Succotash",
                "description": "Succotash is a vegetable and meat stew, often made with corn, beans, and sometimes meat, enjoyed for its rich and hearty flavor."
            },
            {
                "name": "Peppersoup",
                "description": "Peppersoup is a spicy soup made with fish or meat, often flavored with a blend of spices and enjoyed for its bold and aromatic taste."
            },
            {
                "name": "Chicken with Peanut Sauce",
                "description": "Chicken with Peanut Sauce is a dish of chicken cooked in a rich and creamy peanut sauce, enjoyed for its savory and nutty flavor."
            }
        ],
        "dessert": {
            "name": "Malamba",
            "description": "Malamba is a coconut pudding, known for its smooth and creamy texture, often enjoyed as a sweet treat."
        }
    },
    {
        "country": "Eritrea",
        "dishes": [
            {
                "name": "Zigni",
                "description": "Zigni is a spicy meat stew, often made with beef or lamb and flavored with berbere spice, enjoyed for its rich and aromatic taste."
            },
            {
                "name": "Tsebhi Sga",
                "description": "Tsebhi Sga is a meat stew made with berbere spice, often served with injera and enjoyed for its bold and spicy flavor."
            },
            {
                "name": "Injera",
                "description": "Injera is a sourdough flatbread, often used as a base for various stews and enjoyed for its spongy texture and tangy taste."
            }
        ],
        "dessert": {
            "name": "Himbasha",
            "description": "Himbasha is a sweet bread, often flavored with spices such as cardamom and enjoyed for its soft and slightly sweet taste."
        }
    },
    {
        "country": "Estonia",
        "dishes": [
            {
                "name": "Verivorst",
                "description": "Verivorst are blood sausages, typically served during Christmas, known for their hearty and savory flavor, often accompanied by lingonberry jam."
            },
            {
                "name": "Mulgikapsad",
                "description": "Mulgikapsad is a traditional pork and sauerkraut stew, offering a rich and tangy flavor, often served with boiled potatoes."
            },
            {
                "name": "Kiluvõileib",
                "description": "Kiluvõileib is an open-faced sandwich featuring sprats, typically served on dark rye bread with boiled egg slices and fresh herbs."
            }
        ],
        "dessert": {
            "name": "Kringel",
            "description": "Kringel is a sweet, braided bread flavored with cardamom, often decorated with almonds and enjoyed for its rich and aromatic taste."
        }
    },
    {
        "country": "Eswatini (Swaziland)",
        "dishes": [
            {
                "name": "Sishwala",
                "description": "Sishwala is a cornmeal porridge, often served with meat or vegetable stews, known for its smooth texture and versatility."
            },
            {
                "name": "Emasi",
                "description": "Emasi is fermented milk, enjoyed for its tangy flavor and creamy consistency, often consumed as a drink or with porridge."
            },
            {
                "name": "Karoo Roast Ostrich",
                "description": "Karoo Roast Ostrich is a flavorful and lean meat dish, often roasted with spices and herbs, reflecting the unique culinary traditions of the region."
            }
        ],
        "dessert": {
            "name": "Incwancwa",
            "description": "Incwancwa is a sour porridge made from fermented maize, enjoyed for its distinctive tangy taste and smooth texture."
        }
    },
    {
        "country": "Ethiopia",
        "dishes": [
            {
                "name": "Doro Wat",
                "description": "Doro Wat is a spicy chicken stew, made with berbere spice and slow-cooked with onions, garlic, and boiled eggs, enjoyed for its rich and bold flavor."
            },
            {
                "name": "Tibs",
                "description": "Tibs is a stir-fried meat dish, typically made with beef or lamb, onions, and spices, known for its savory and aromatic taste."
            },
            {
                "name": "Kitfo",
                "description": "Kitfo is minced raw beef, seasoned with spices and often served with injera and traditional cheese, offering a unique and rich flavor."
            }
        ],
        "dessert": {
            "name": "Dabo Kolo",
            "description": "Dabo Kolo are small, crunchy pieces of fried dough, often spiced with berbere and enjoyed as a sweet and savory snack."
        }
    },
    {
        "country": "Fiji",
        "dishes": [
            {
                "name": "Kokoda",
                "description": "Kokoda is a marinated raw fish salad, made with fresh fish, coconut milk, lime juice, and spices, enjoyed for its refreshing and tangy flavor."
            },
            {
                "name": "Lovo",
                "description": "Lovo is a traditional Fijian feast cooked in an underground oven, featuring a variety of meats, vegetables, and root crops, known for its smoky and rich taste."
            },
            {
                "name": "Rourou",
                "description": "Rourou is a dish of taro leaves cooked in coconut milk, offering a creamy and flavorful taste, often served as a side dish."
            }
        ],
        "dessert": {
            "name": "Cassava Cake",
            "description": "Cassava Cake is a sweet and dense cake made from grated cassava, coconut milk, and sugar, enjoyed for its rich and moist texture."
        }
    },
    {
        "country": "Finland",
        "dishes": [
            {
                "name": "Karjalanpaisti",
                "description": "Karjalanpaisti is a Karelian stew made with a mix of meats, typically beef and pork, slow-cooked with root vegetables, enjoyed for its hearty and comforting flavor."
            },
            {
                "name": "Kalakukko",
                "description": "Kalakukko is a traditional Finnish fish pie, made with fish, usually perch or salmon, baked inside a rye crust, known for its savory and unique taste."
            },
            {
                "name": "Ruisleipä",
                "description": "Ruisleipä is a dense and tangy rye bread, a staple in Finnish cuisine, enjoyed for its hearty texture and rich flavor."
            }
        ],
        "dessert": {
            "name": "Runeberg Torte",
            "description": "Runeberg Torte is an almond-flavored pastry topped with raspberry jam and icing, traditionally enjoyed to celebrate the poet Johan Ludvig Runeberg."
        }
    },
    {
        "country": "France",
        "dishes": [
            {
                "name": "Coq au Vin",
                "description": "Coq au Vin is a classic French dish of chicken braised in red wine with mushrooms, onions, and bacon, enjoyed for its rich and complex flavor."
            },
            {
                "name": "Bouillabaisse",
                "description": "Bouillabaisse is a traditional fish stew from Provence, made with a variety of fish, shellfish, tomatoes, and saffron, known for its aromatic and flavorful broth."
            },
            {
                "name": "Ratatouille",
                "description": "Ratatouille is a vegetable stew made with eggplant, zucchini, bell peppers, tomatoes, and herbs, enjoyed for its fresh and vibrant taste."
            }
        ],
        "dessert": {
            "name": "Crème Brûlée",
            "description": "Crème Brûlée is a creamy custard dessert topped with a layer of caramelized sugar, known for its rich and smooth texture."
        }
    },
    {
        "country": "Gabon",
        "dishes": [
            {
                "name": "Poulet Nyembwe",
                "description": "Poulet Nyembwe is a chicken dish cooked in a rich palm nut sauce, known for its hearty and flavorful taste."
            },
            {
                "name": "Nyembwe",
                "description": "Nyembwe is a palm nut soup, often made with meat or fish, enjoyed for its rich and savory flavor."
            },
            {
                "name": "Atanga",
                "description": "Atanga, also known as African pear, is often boiled or roasted, enjoyed for its creamy texture and slightly nutty flavor."
            }
        ],
        "dessert": {
            "name": "Baked Bananas",
            "description": "Baked Bananas are a simple and sweet dessert, often flavored with sugar and spices, enjoyed for their caramelized and rich taste."
        }
    },
    {
        "country": "Gambia",
        "dishes": [
            {
                "name": "Domoda",
                "description": "Domoda is a peanut stew, typically made with meat or fish, tomatoes, and vegetables, known for its creamy and savory flavor."
            },
            {
                "name": "Benachin",
                "description": "Benachin, also known as Jollof rice, is a one-pot rice dish cooked with tomatoes, vegetables, and meat or fish, enjoyed for its rich and spicy taste."
            },
            {
                "name": "Yassa",
                "description": "Yassa is a marinated chicken or fish dish, cooked with onions, lemon, and mustard, known for its tangy and savory flavor."
            }
        ],
        "dessert": {
            "name": "Chakery",
            "description": "Chakery is a couscous pudding, often sweetened with sugar and flavored with milk, spices, and sometimes fruit, enjoyed for its creamy and sweet taste."
        }
    },
    {
        "country": "Georgia",
        "dishes": [
            {
                "name": "Khachapuri",
                "description": "Khachapuri is a cheese-filled bread, often topped with an egg and butter, enjoyed for its rich and savory flavor."
            },
            {
                "name": "Khinkali",
                "description": "Khinkali are dumplings filled with spiced meat, enjoyed for their juicy and flavorful filling, typically eaten with a sprinkling of black pepper."
            },
            {
                "name": "Satsivi",
                "description": "Satsivi is a chicken dish served with a rich walnut sauce, flavored with garlic and spices, enjoyed for its creamy and nutty taste."
            }
        ],
        "dessert": {
            "name": "Churchkhela",
            "description": "Churchkhela is a traditional Georgian candy made from nuts dipped in a thickened grape juice mixture, enjoyed for its chewy texture and sweet, fruity flavor."
        }
    },
    {
        "country": "Germany",
        "dishes": [
            {
                "name": "Sauerbraten",
                "description": "Sauerbraten is a pot roast marinated in a mixture of vinegar, water, and spices, slow-cooked until tender, known for its tangy and savory flavor."
            },
            {
                "name": "Bratwurst",
                "description": "Bratwurst is a type of German sausage made from pork, beef, or veal, often grilled and enjoyed for its juicy and savory taste."
            },
            {
                "name": "Schnitzel",
                "description": "Schnitzel is a breaded and fried meat cutlet, typically made with pork or veal, enjoyed for its crispy exterior and tender interior."
            }
        ],
        "dessert": {
            "name": "Black Forest Cake",
            "description": "Black Forest Cake is a chocolate cake layered with cherries and whipped cream, known for its rich and indulgent flavor."
        }
    },
    {
        "country": "Ghana",
        "dishes": [
            {
                "name": "Jollof Rice",
                "description": "Jollof Rice is a spiced rice dish cooked with tomatoes, onions, and meat or fish, enjoyed for its rich and flavorful taste."
            },
            {
                "name": "Fufu",
                "description": "Fufu is a dough-like food made from pounded yam or cassava, often served with soups and stews, known for its smooth texture and versatility."
            },
            {
                "name": "Banku",
                "description": "Banku is a fermented corn and cassava dough, often served with soups or stews, enjoyed for its slightly sour taste and smooth texture."
            }
        ],
        "dessert": {
            "name": "Bofrot",
            "description": "Bofrot are fried dough balls, similar to donuts, enjoyed for their sweet and crispy texture."
        }
    },
    {
        "country": "Greece",
        "dishes": [
            {
                "name": "Moussaka",
                "description": "Moussaka is an eggplant and meat casserole, layered with a rich béchamel sauce, baked until golden and enjoyed for its hearty and comforting flavor."
            },
            {
                "name": "Souvlaki",
                "description": "Souvlaki are grilled meat skewers, often served with pita bread, tzatziki, and salad, enjoyed for their smoky and savory taste."
            },
            {
                "name": "Spanakopita",
                "description": "Spanakopita is a spinach pie made with layers of filo pastry and a filling of spinach and feta cheese, enjoyed for its flaky texture and savory taste."
            }
        ],
        "dessert": {
            "name": "Baklava",
            "description": "Baklava is a sweet filo pastry filled with nuts and soaked in syrup, known for its rich and sweet flavor."
        }
    },
    {
        "country": "Grenada",
        "dishes": [
            {
                "name": "Oil Down",
                "description": "Oil Down is a hearty stew made with breadfruit, salted meat, and coconut milk, cooked until all the liquid is absorbed, enjoyed for its rich and savory flavor."
            },
            {
                "name": "Callaloo Soup",
                "description": "Callaloo Soup is a creamy and nutritious soup made with callaloo leaves, coconut milk, and various spices, enjoyed for its rich and flavorful taste."
            },
            {
                "name": "Crab Back",
                "description": "Crab Back is a dish of stuffed crab shells, filled with a mixture of crab meat, breadcrumbs, and spices, baked to perfection."
            }
        ],
        "dessert": {
            "name": "Nutmeg Ice Cream",
            "description": "Nutmeg Ice Cream is a creamy and flavorful dessert, made with fresh nutmeg, enjoyed for its unique and aromatic taste."
        }
    },
    {
        "country": "Guatemala",
        "dishes": [
            {
                "name": "Pepian",
                "description": "Pepian is a spicy meat stew, typically made with chicken or beef, and a rich blend of spices and seeds, enjoyed for its bold and complex flavor."
            },
            {
                "name": "Kak'ik",
                "description": "Kak'ik is a traditional turkey soup, made with tomatoes, bell peppers, and spices, enjoyed for its rich and hearty taste."
            },
            {
                "name": "Jocon",
                "description": "Jocon is a chicken dish cooked in a green sauce made from tomatillos, cilantro, and other herbs, known for its fresh and tangy flavor."
            }
        ],
        "dessert": {
            "name": "Rellenitos",
            "description": "Rellenitos are fried plantains filled with sweet black beans, enjoyed for their crispy exterior and sweet, creamy filling."
        }
    },
    {
        "country": "Guinea",
        "dishes": [
            {
                "name": "Poulet Yassa",
                "description": "Poulet Yassa is marinated chicken cooked with onions, lemon, and mustard, known for its tangy and savory flavor."
            },
            {
                "name": "Konkoé",
                "description": "Konkoé is a smoked fish stew, often cooked with vegetables and spices, enjoyed for its rich and smoky taste."
            },
            {
                "name": "Maafe",
                "description": "Maafe is a peanut stew, typically made with meat or fish, tomatoes, and vegetables, known for its creamy and savory flavor."
            }
        ],
        "dessert": {
            "name": "Banana Fritters",
            "description": "Banana Fritters are pieces of banana fried in a light batter, enjoyed for their crispy exterior and sweet, soft interior."
        }
    },
    {
        "country": "Guinea-Bissau",
        "dishes": [
            {
                "name": "Caldinho de Peixe",
                "description": "Caldinho de Peixe is a fish stew, often made with tomatoes, peppers, and spices, enjoyed for its rich and flavorful broth."
            },
            {
                "name": "Jollof Rice",
                "description": "Jollof Rice is a spiced rice dish cooked with tomatoes, onions, and meat or fish, enjoyed for its rich and flavorful taste."
            },
            {
                "name": "Fumbwa",
                "description": "Fumbwa is a wild spinach stew, often cooked with palm oil and spices, known for its earthy and savory flavor."
            }
        ],
        "dessert": {
            "name": "Canjica",
            "description": "Canjica is a sweet corn pudding, often flavored with coconut milk and spices, enjoyed for its creamy and sweet taste."
        }
    },
    {
        "country": "Guyana",
        "dishes": [
            {
                "name": "Pepperpot",
                "description": "Pepperpot is a spicy meat stew, traditionally made with cassareep and a variety of meats, enjoyed for its rich and flavorful taste."
            },
            {
                "name": "Cook-Up Rice",
                "description": "Cook-Up Rice is a one-pot rice dish, typically made with meat, beans, and vegetables, enjoyed for its hearty and savory flavor."
            },
            {
                "name": "Roti and Curry",
                "description": "Roti and Curry is a popular dish featuring flatbread served with a variety of flavorful curries, enjoyed for its rich and aromatic taste."
            }
        ],
        "dessert": {
            "name": "Black Cake",
            "description": "Black Cake is a dense fruitcake, often soaked in rum and spices, enjoyed for its rich and festive flavor."
        }
    },
    {
        "country": "Haiti",
        "dishes": [
            {
                "name": "Griot",
                "description": "Griot is a dish of marinated and fried pork, often served with pikliz (spicy pickled vegetables), enjoyed for its tender and flavorful meat."
            },
            {
                "name": "Joumou",
                "description": "Joumou is a pumpkin soup, traditionally served on Haitian Independence Day, known for its rich and hearty flavor."
            },
            {
                "name": "Tassot",
                "description": "Tassot is a dish of fried beef or goat, marinated in citrus juice and spices, enjoyed for its crispy exterior and tender meat."
            }
        ],
        "dessert": {
            "name": "Pain Patate",
            "description": "Pain Patate is a sweet potato pudding, often flavored with coconut and spices, enjoyed for its rich and creamy texture."
        }
    },
    {
        "country": "Honduras",
        "dishes": [
            {
                "name": "Baleadas",
                "description": "Baleadas are flour tortillas filled with beans, cheese, and often other ingredients like avocado or meat, enjoyed for their hearty and satisfying taste."
            },
            {
                "name": "Sopa de Caracol",
                "description": "Sopa de Caracol is a conch soup, made with coconut milk, vegetables, and spices, known for its rich and creamy flavor."
            },
            {
                "name": "Carne Asada",
                "description": "Carne Asada is grilled meat, typically marinated and cooked over an open flame, enjoyed for its smoky and savory taste."
            }
        ],
        "dessert": {
            "name": "Tres Leches Cake",
            "description": "Tres Leches Cake is a sponge cake soaked in three kinds of milk (evaporated, condensed, and whole milk), known for its moist and rich texture."
        }
    },
    {
        "country": "Hungary",
        "dishes": [
            {
                "name": "Gulyás",
                "description": "Gulyás, or goulash, is a hearty soup made with beef, potatoes, and paprika, enjoyed for its rich and warming flavor."
            },
            {
                "name": "Pörkölt",
                "description": "Pörkölt is a meat stew, typically made with pork or beef, onions, and paprika, known for its rich and savory taste."
            },
            {
                "name": "Lángos",
                "description": "Lángos is a fried dough, often topped with garlic, cheese, and sour cream, enjoyed for its crispy exterior and soft interior."
            }
        ],
        "dessert": {
            "name": "Dobos Torte",
            "description": "Dobos Torte is a layered sponge cake filled with chocolate buttercream and topped with caramel, known for its rich and indulgent flavor."
        }
    },
    {
        "country": "Iceland",
        "dishes": [
            {
                "name": "Hákarl",
                "description": "Hákarl is fermented shark, traditionally cured and enjoyed for its distinctive and strong flavor."
            },
            {
                "name": "Plokkfiskur",
                "description": "Plokkfiskur is a fish stew made with cooked fish, potatoes, and onions, enjoyed for its creamy and comforting taste."
            },
            {
                "name": "Skyr",
                "description": "Skyr is a thick, yogurt-like dairy product, known for its smooth and creamy texture and enjoyed with a variety of toppings."
            }
        ],
        "dessert": {
            "name": "Kleinur",
            "description": "Kleinur are twisted fried dough pastries, often flavored with cardamom, enjoyed for their sweet and crispy texture."
        }
    },
    {
        "country": "India",
        "dishes": [
            {
                "name": "Biryani",
                "description": "Biryani is a spiced rice dish cooked with meat or vegetables, known for its aromatic and flavorful taste."
            },
            {
                "name": "Butter Chicken",
                "description": "Butter Chicken is a dish of chicken cooked in a creamy tomato sauce, known for its rich and savory flavor."
            },
            {
                "name": "Masala Dosa",
                "description": "Masala Dosa is a crispy rice and lentil crepe filled with a spicy potato mixture, enjoyed for its savory and tangy taste."
            }
        ],
        "dessert": {
            "name": "Gulab Jamun",
            "description": "Gulab Jamun are milk-based fried balls soaked in a sweet syrup, known for their rich and indulgent flavor."
        }
    },
    {
        "country": "Indonesia",
        "dishes": [
            {
                "name": "Nasi Goreng",
                "description": "Nasi Goreng is a fried rice dish, typically made with kecap manis (sweet soy sauce), eggs, and vegetables, enjoyed for its savory and slightly sweet taste."
            },
            {
                "name": "Satay",
                "description": "Satay are grilled meat skewers, often served with a spicy peanut sauce, known for their smoky and savory flavor."
            },
            {
                "name": "Rendang",
                "description": "Rendang is a spicy beef stew, slow-cooked with coconut milk and spices, enjoyed for its rich and tender texture."
            }
        ],
        "dessert": {
            "name": "Es Teler",
            "description": "Es Teler is a fruit cocktail made with coconut milk, avocado, jackfruit, and other fruits, enjoyed for its refreshing and sweet taste."
        }
    },
    {
        "country": "Iran",
        "dishes": [
            {
                "name": "Chelo Kebab",
                "description": "Chelo Kebab is a dish of grilled meat served with rice, often accompanied by grilled tomatoes and onions, known for its rich and savory flavor."
            },
            {
                "name": "Ghormeh Sabzi",
                "description": "Ghormeh Sabzi is an herb stew made with fresh herbs, kidney beans, and lamb, enjoyed for its aromatic and tangy taste."
            },
            {
                "name": "Fesenjan",
                "description": "Fesenjan is a pomegranate walnut stew, typically made with chicken or duck, known for its rich and sweet-tart flavor."
            }
        ],
        "dessert": {
            "name": "Bastani Sonnati",
            "description": "Bastani Sonnati is a traditional Persian ice cream, often flavored with saffron, rose water, and pistachios, enjoyed for its unique and rich taste."
        }
    },
    {
        "country": "Iraq",
        "dishes": [
            {
                "name": "Masgouf",
                "description": "Masgouf is a grilled fish dish, traditionally prepared by splitting the fish and cooking it over an open flame, known for its smoky and flavorful taste."
            },
            {
                "name": "Kubba",
                "description": "Kubba are fried meat-stuffed bulgur patties, often enjoyed as a savory snack or appetizer."
            },
            {
                "name": "Tashreeb",
                "description": "Tashreeb is a dish of bread soaked in broth, often served with meat and vegetables, known for its hearty and comforting flavor."
            }
        ],
        "dessert": {
            "name": "Kleicha",
            "description": "Kleicha are date-filled cookies, often flavored with spices such as cardamom and cinnamon, enjoyed for their rich and sweet taste."
        }
    },
    {
        "country": "Ireland",
        "dishes": [
            {
                "name": "Irish Stew",
                "description": "Irish Stew is a hearty stew made with lamb or beef, potatoes, carrots, and onions, known for its rich and comforting flavors."
            },
            {
                "name": "Boxty",
                "description": "Boxty are traditional Irish potato pancakes, often enjoyed for their crispy exterior and soft, fluffy interior."
            },
            {
                "name": "Colcannon",
                "description": "Colcannon is a dish of mashed potatoes mixed with cabbage or kale, known for its creamy texture and savory taste."
            }
        ],
        "dessert": {
            "name": "Bread and Butter Pudding",
            "description": "Bread and Butter Pudding is a beloved Irish dessert made with layers of buttered bread, custard, and raisins, baked until golden and enjoyed for its rich, comforting flavor."
        }
    },
    {
        "country": "Israel",
        "dishes": [
            {
                "name": "Falafel",
                "description": "Falafel are deep-fried balls made from ground chickpeas, herbs, and spices, often served in pita bread with salad and tahini sauce."
            },
            {
                "name": "Shakshuka",
                "description": "Shakshuka is a dish of poached eggs cooked in a spicy tomato and bell pepper sauce, enjoyed for its bold and vibrant flavors."
            },
            {
                "name": "Hummus",
                "description": "Hummus is a creamy dip made from blended chickpeas, tahini, lemon juice, and garlic, often served with pita bread and vegetables."
            }
        ],
        "dessert": {
            "name": "Malabi",
            "description": "Malabi is a milk pudding flavored with rose water and topped with syrup and nuts, known for its creamy texture and delicate flavor."
        }
    },
    {
        "country": "Italy",
        "dishes": [
            {
                "name": "Pizza Margherita",
                "description": "Pizza Margherita is a classic Italian pizza topped with fresh tomatoes, mozzarella cheese, and basil, celebrated for its simple yet delicious flavors."
            },
            {
                "name": "Lasagna",
                "description": "Lasagna is a baked pasta dish layered with rich meat sauce, béchamel, and cheese, enjoyed for its hearty and comforting taste."
            },
            {
                "name": "Risotto",
                "description": "Risotto is a creamy rice dish cooked with broth, wine, and often various ingredients like mushrooms or seafood, known for its rich and velvety texture."
            }
        ],
        "dessert": {
            "name": "Tiramisu",
            "description": "Tiramisu is a coffee-flavored layered dessert made with ladyfingers, mascarpone cheese, and cocoa, loved for its rich and indulgent taste."
        }
    },
    {
        "country": "Ivory Coast (Côte d'Ivoire)",
        "dishes": [
            {
                "name": "Attiéké",
                "description": "Attiéké is a couscous-like side dish made from fermented cassava, known for its light and slightly tangy flavor."
            },
            {
                "name": "Kedjenou",
                "description": "Kedjenou is a spicy chicken stew cooked slowly in a sealed pot, celebrated for its tender meat and rich, flavorful broth."
            },
            {
                "name": "Alloco",
                "description": "Alloco are fried plantains, often served as a side dish or snack, enjoyed for their sweet and crispy texture."
            }
        ],
        "dessert": {
            "name": "Clafoutis",
            "description": "Clafoutis is a fruit tart, traditionally made with cherries baked in a flan-like batter, known for its rich and custardy texture."
        }
    },
    {
        "country": "Jamaica",
        "dishes": [
            {
                "name": "Jerk Chicken",
                "description": "Jerk Chicken is a spicy grilled chicken marinated with a blend of Scotch bonnet peppers, allspice, and other seasonings, known for its fiery and flavorful taste."
            },
            {
                "name": "Ackee and Saltfish",
                "description": "Ackee and Saltfish is Jamaica's national dish, made with salted cod and ackee fruit, enjoyed for its savory and unique flavor."
            },
            {
                "name": "Curry Goat",
                "description": "Curry Goat is a rich and spicy stew made with goat meat, curry spices, and coconut milk, enjoyed for its bold and aromatic taste."
            }
        ],
        "dessert": {
            "name": "Rum Cake",
            "description": "Rum Cake is a dense cake soaked in rum, often served during the holidays, known for its rich and moist texture."
        }
    },
    {
        "country": "Japan",
        "dishes": [
            {
                "name": "Sushi",
                "description": "Sushi is a traditional Japanese dish featuring vinegared rice, raw fish, and various other ingredients, celebrated for its fresh and delicate flavors."
            },
            {
                "name": "Ramen",
                "description": "Ramen is a noodle soup dish with a rich broth, often topped with slices of meat, vegetables, and a boiled egg, enjoyed for its hearty and comforting taste."
            },
            {
                "name": "Tempura",
                "description": "Tempura consists of battered and deep-fried seafood or vegetables, known for its light and crispy texture."
            }
        ],
        "dessert": {
            "name": "Mochi",
            "description": "Mochi is a rice cake made from glutinous rice, often filled with sweet bean paste, enjoyed for its chewy texture and subtle sweetness."
        }
    },
    {
        "country": "Jordan",
        "dishes": [
            {
                "name": "Mansaf",
                "description": "Mansaf is a traditional Jordanian dish made with lamb cooked in a fermented yogurt sauce, served over rice, known for its rich and tangy flavors."
            },
            {
                "name": "Maqluba",
                "description": "Maqluba is a layered rice and meat dish, often flipped upside down before serving, celebrated for its savory taste and beautiful presentation."
            },
            {
                "name": "Kebab",
                "description": "Kebab consists of skewered and grilled meat, often seasoned with a blend of spices, enjoyed for its smoky and flavorful taste."
            }
        ],
        "dessert": {
            "name": "Knafeh",
            "description": "Knafeh is a sweet cheese pastry soaked in syrup, often topped with nuts, known for its rich and gooey texture."
        }
    },
    {
        "country": "Kazakhstan",
        "dishes": [
            {
                "name": "Beshbarmak",
                "description": "Beshbarmak is a traditional dish made with boiled meat (usually horse or lamb) served over noodles, known for its hearty and savory flavors."
            },
            {
                "name": "Kazy",
                "description": "Kazy is a horse meat sausage, often served as an appetizer, celebrated for its unique and robust flavor."
            },
            {
                "name": "Shashlik",
                "description": "Shashlik consists of marinated and grilled meat skewers, enjoyed for their smoky and tender taste."
            }
        ],
        "dessert": {
            "name": "Baursak",
            "description": "Baursak are fried dough balls, often enjoyed as a sweet treat, known for their light and fluffy texture."
        }
    },
    {
        "country": "Kenya",
        "dishes": [
            {
                "name": "Nyama Choma",
                "description": "Nyama Choma is grilled meat, often goat or beef, known for its smoky flavor and enjoyed as a popular social dish."
            },
            {
                "name": "Ugali",
                "description": "Ugali is a dense maize porridge, often served as a staple side dish, enjoyed for its versatility and ability to complement various stews and sauces."
            },
            {
                "name": "Sukuma Wiki",
                "description": "Sukuma Wiki is a dish of sautéed collard greens, often cooked with onions and tomatoes, known for its nutritious and flavorful taste."
            }
        ],
        "dessert": {
            "name": "Mandazi",
            "description": "Mandazi are fried doughnuts, often flavored with coconut or cardamom, enjoyed for their sweet and fluffy texture."
        }
    },
    {
        "country": "Kiribati",
        "dishes": [
            {
                "name": "Te Bua Toro Ni Baukin",
                "description": "Te Bua Toro Ni Baukin is a dish made with giant clam and coconut, celebrated for its unique and rich flavors."
            },
            {
                "name": "Palu Sami",
                "description": "Palu Sami is a dish of taro leaves cooked in coconut cream, known for its creamy and savory taste."
            },
            {
                "name": "Babai",
                "description": "Babai is fermented taro, enjoyed for its distinct and tangy flavor."
            }
        ],
        "dessert": {
            "name": "Pumpkin Pie",
            "description": "Pumpkin Pie is a beloved dessert in Kiribati, made with spiced pumpkin filling and known for its rich and comforting flavor."
        }
    },
    {
        "country": "Korea, North",
        "dishes": [
            {
                "name": "Naengmyeon",
                "description": "Naengmyeon are cold noodles served in a tangy broth, often enjoyed during the summer for their refreshing taste."
            },
            {
                "name": "Kimchi",
                "description": "Kimchi is a fermented vegetable dish, typically made with cabbage and radishes, known for its spicy and tangy flavor."
            },
            {
                "name": "Pibimpap",
                "description": "Pibimpap is a mixed rice dish with vegetables, meat, and a spicy sauce, celebrated for its colorful presentation and balanced flavors."
            }
        ],
        "dessert": {
            "name": "Tteok",
            "description": "Tteok are rice cakes, often enjoyed as a sweet treat, known for their chewy texture and subtle sweetness."
        }
    },
    {
        "country": "Korea, South",
        "dishes": [
            {
                "name": "Kimchi",
                "description": "Kimchi is a fermented vegetable dish, typically made with cabbage and radishes, known for its spicy and tangy flavor."
            },
            {
                "name": "Bulgogi",
                "description": "Bulgogi is marinated grilled beef, enjoyed for its savory and slightly sweet taste."
            },
            {
                "name": "Bibimbap",
                "description": "Bibimbap is a mixed rice dish with vegetables, meat, and a spicy sauce, celebrated for its colorful presentation and balanced flavors."
            }
        ],
        "dessert": {
            "name": "Hotteok",
            "description": "Hotteok are sweet pancakes filled with sugar, nuts, and spices, known for their crispy exterior and gooey, sweet filling."
        }
    },
    {
        "country": "Kosovo",
        "dishes": [
            {
                "name": "Flija",
                "description": "Flija is a layered pancake, often cooked over an open flame, known for its soft and chewy texture."
            },
            {
                "name": "Tava e Prizrenit",
                "description": "Tava e Prizrenit is a baked dish made with meat and vegetables, celebrated for its hearty and flavorful taste."
            },
            {
                "name": "Burek",
                "description": "Burek is a savory pastry filled with meat, cheese, or spinach, enjoyed for its crispy layers and rich filling."
            }
        ],
        "dessert": {
            "name": "Baklava",
            "description": "Baklava is a sweet filo pastry with nuts and syrup, known for its rich and indulgent flavor."
        }
    },
    {
        "country": "Kuwait",
        "dishes": [
            {
                "name": "Machboos",
                "description": "Machboos is a spiced rice dish with meat, often lamb or chicken, known for its aromatic and flavorful taste."
            },
            {
                "name": "Jireesh",
                "description": "Jireesh is a dish made with cracked wheat and meat, enjoyed for its creamy texture and savory flavor."
            },
            {
                "name": "Mutabbaq Samak",
                "description": "Mutabbaq Samak is a fish and rice dish, celebrated for its rich and flavorful taste."
            }
        ],
        "dessert": {
            "name": "Gers Ogaily",
            "description": "Gers Ogaily is a saffron and cardamom cake, known for its aromatic and rich flavor."
        }
    },
    {
        "country": "Kyrgyzstan",
        "dishes": [
            {
                "name": "Beshbarmak",
                "description": "Beshbarmak is a traditional dish made with boiled meat (usually lamb or beef) served over noodles, known for its hearty and savory flavors."
            },
            {
                "name": "Laghman",
                "description": "Laghman is a noodle dish with meat and vegetables, enjoyed for its rich and flavorful taste."
            },
            {
                "name": "Kuurdak",
                "description": "Kuurdak is a dish of fried meat with onions and potatoes, celebrated for its hearty and savory flavor."
            }
        ],
        "dessert": {
            "name": "Chak-Chak",
            "description": "Chak-Chak are fried dough pieces coated in honey, known for their sweet and crispy texture."
        }
    },
    {
        "country": "Laos",
        "dishes": [
            {
                "name": "Laap",
                "description": "Laap is a minced meat salad, often made with herbs, lime juice, and fish sauce, known for its fresh and tangy flavors."
            },
            {
                "name": "Tam Mak Hoong",
                "description": "Tam Mak Hoong is a spicy papaya salad, enjoyed for its bold and vibrant taste."
            },
            {
                "name": "Or Lam",
                "description": "Or Lam is a spicy stew, typically made with meat, eggplant, and green beans, celebrated for its hearty and flavorful taste."
            }
        ],
        "dessert": {
            "name": "Khao Tom",
            "description": "Khao Tom is sticky rice wrapped in banana leaves, often filled with sweet or savory ingredients, known for its rich and comforting flavor."
        }
    },
    {
        "country": "Latvia",
        "dishes": [
            {
                "name": "Sklandrausis",
                "description": "Sklandrausis is a traditional pie made with a rye crust and filled with potato and carrot, known for its sweet and savory flavors."
            },
            {
                "name": "Karbonade",
                "description": "Karbonade is a pork cutlet, often breaded and fried, celebrated for its crispy exterior and juicy interior."
            },
            {
                "name": "Grey Peas with Bacon",
                "description": "Grey Peas with Bacon is a hearty dish made with peas and crispy bacon, enjoyed for its rich and savory taste."
            }
        ],
        "dessert": {
            "name": "Rupjmaizes Kārtojums",
            "description": "Rupjmaizes Kārtojums is a layered rye bread dessert, often made with whipped cream and fruit, known for its unique and rich flavor."
        }
    },
    {
        "country": "Lebanon",
        "dishes": [
            {
                "name": "Kibbeh",
                "description": "Kibbeh are meat and bulgur patties, often filled with ground meat and spices, known for their rich and savory flavor."
            },
            {
                "name": "Tabbouleh",
                "description": "Tabbouleh is a salad made with parsley, bulgur, tomatoes, and lemon juice, celebrated for its fresh and vibrant taste."
            },
            {
                "name": "Manakish",
                "description": "Manakish is a flatbread topped with various ingredients like za'atar, cheese, or meat, enjoyed for its versatile and delicious flavors."
            }
        ],
        "dessert": {
            "name": "Ma'amoul",
            "description": "Ma'amoul are date-filled cookies, often enjoyed during holidays, known for their rich and sweet taste."
        }
    },
    {
        "country": "Lesotho",
        "dishes": [
            {
                "name": "Papa",
                "description": "Papa is a maize porridge, often served as a staple side dish, known for its simple and comforting flavor."
            },
            {
                "name": "Moroho",
                "description": "Moroho are leafy greens, often sautéed with onions and tomatoes, enjoyed for their nutritious and savory taste."
            },
            {
                "name": "Nyama",
                "description": "Nyama is a meat stew, often made with beef or goat, celebrated for its hearty and rich flavor."
            }
        ],
        "dessert": {
            "name": "Likoti",
            "description": "Likoti are sweet dumplings, known for their soft and fluffy texture and sweet flavor."
        }
    },
    {
        "country": "Liberia",
        "dishes": [
            {
                "name": "Jollof Rice",
                "description": "Jollof Rice is a spiced rice dish often cooked with tomatoes and meat, known for its rich and savory flavor."
            },
            {
                "name": "Palava Sauce",
                "description": "Palava Sauce is a spicy stew made with spinach and sometimes meat or fish, enjoyed for its bold and flavorful taste."
            },
            {
                "name": "Fufu",
                "description": "Fufu is a dough-like food made from pounded yam or cassava, often served with soups or stews, known for its smooth and stretchy texture."
            }
        ],
        "dessert": {
            "name": "Coconut Cake",
            "description": "Coconut Cake is a beloved dessert in Liberia, known for its moist and rich texture and sweet coconut flavor."
        }
    },
    {
        "country": "Libya",
        "dishes": [
            {
                "name": "Couscous",
                "description": "Couscous is a steamed semolina dish often served with meat and vegetables, celebrated for its light and fluffy texture."
            },
            {
                "name": "Shakshuka",
                "description": "Shakshuka is a dish of poached eggs in a spicy tomato sauce, enjoyed for its bold and flavorful taste."
            },
            {
                "name": "Bazin",
                "description": "Bazin is an unleavened bread served with meat and gravy, known for its dense and hearty texture."
            }
        ],
        "dessert": {
            "name": "Asida",
            "description": "Asida is a sweet wheat pudding, often enjoyed during special occasions, known for its smooth and rich flavor."
        }
    },
    {
        "country": "Malawi",
        "dishes": [
            {
                "name": "Nsima",
                "description": "Nsima is a thick maize porridge, a staple food in Malawi, known for its simple yet satisfying flavor and its role as a base for various relishes."
            },
            {
                "name": "Chambo",
                "description": "Chambo is a type of tilapia fish, often grilled or fried, and celebrated for its tender and flavorful meat, commonly served with nsima."
            },
            {
                "name": "Kondowole",
                "description": "Kondowole is a dish made from cassava flour, known for its dense texture and slightly tangy flavor, often served as an accompaniment to savory stews."
            }
        ],
        "dessert": {
            "name": "Mbatata",
            "description": "Mbatata are sweet potato cookies, enjoyed for their sweet and comforting flavor, often enhanced with a hint of cinnamon or nutmeg."
        }
    },
    {
        "country": "Malaysia",
        "dishes": [
            {
                "name": "Nasi Lemak",
                "description": "Nasi Lemak is coconut rice served with sambal, anchovies, peanuts, boiled egg, and cucumber, a national dish of Malaysia known for its rich and aromatic flavors."
            },
            {
                "name": "Rendang",
                "description": "Rendang is a spicy meat stew, typically made with beef, slow-cooked in coconut milk and a blend of spices, renowned for its tender texture and intense flavor."
            },
            {
                "name": "Laksa",
                "description": "Laksa is a spicy noodle soup, combining elements of Chinese and Malay cuisine, known for its tangy, spicy, and slightly creamy broth."
            }
        ],
        "dessert": {
            "name": "Kuih",
            "description": "Kuih refers to a variety of sweet and savory snacks, often made from rice flour, coconut, and palm sugar, celebrated for their colorful appearance and diverse flavors."
        }
    },
    {
        "country": "Maldives",
        "dishes": [
            {
                "name": "Garudhiya",
                "description": "Garudhiya is a fish soup made with tuna, served with rice, lime, chili, and onions, known for its light and savory flavor, often enjoyed as a comfort food."
            },
            {
                "name": "Mas Huni",
                "description": "Mas Huni is a traditional Maldivian breakfast dish, consisting of tuna mixed with coconut, onions, and chili, served with flatbread, celebrated for its fresh and spicy taste."
            },
            {
                "name": "Fihunu Mas",
                "description": "Fihunu Mas is grilled fish, typically marinated in a blend of spices and coconut, known for its smoky flavor and tender texture."
            }
        ],
        "dessert": {
            "name": "Dhonkeyo Kajuru",
            "description": "Dhonkeyo Kajuru is a banana cake, known for its moist and dense texture, often flavored with coconut and cardamom."
        }
    },
    {
        "country": "Mali",
        "dishes": [
            {
                "name": "Tiguadege Na",
                "description": "Tiguadege Na is a peanut butter stew, typically made with meat and vegetables, celebrated for its rich and creamy texture and nutty flavor."
            },
            {
                "name": "Jollof Rice",
                "description": "Jollof Rice is a spiced rice dish with meat and vegetables, known for its vibrant orange color and savory, slightly spicy taste."
            },
            {
                "name": "Fakoye",
                "description": "Fakoye is a spicy spinach stew, often made with meat or fish, known for its robust flavor and nutritious ingredients."
            }
        ],
        "dessert": {
            "name": "Malian Beignets",
            "description": "Malian Beignets are fried dough treats, enjoyed for their crispy exterior and soft, sweet interior, often dusted with powdered sugar."
        }
    },
    {
        "country": "Malta",
        "dishes": [
            {
                "name": "Fenkata",
                "description": "Fenkata is a traditional rabbit stew, slowly cooked with wine and herbs, celebrated for its tender meat and rich, savory flavor."
            },
            {
                "name": "Pastizzi",
                "description": "Pastizzi are savory pastries, typically filled with ricotta or mushy peas, known for their flaky crust and flavorful fillings."
            },
            {
                "name": "Bragioli",
                "description": "Bragioli, also known as beef olives, are thin slices of beef stuffed with a mixture of bacon, eggs, and breadcrumbs, simmered in a rich tomato sauce."
            }
        ],
        "dessert": {
            "name": "Kannoli",
            "description": "Kannoli are sweet pastries filled with ricotta cheese, often flavored with citrus and chocolate, known for their crisp shell and creamy filling."
        }
    },
    {
        "country": "Marshall Islands",
        "dishes": [
            {
                "name": "Palao",
                "description": "Palao is a rice dish made with chicken or fish, known for its aromatic flavors and often seasoned with local herbs and spices."
            },
            {
                "name": "Barramundi Cod",
                "description": "Barramundi Cod is grilled fish, prized for its firm, flaky meat and delicate, mild flavor, often served with a variety of local side dishes."
            },
            {
                "name": "Coconut Crab",
                "description": "Coconut Crab is a prized delicacy, known for its rich, sweet meat and often prepared with a coconut-based sauce."
            }
        ],
        "dessert": {
            "name": "Macadamia Nut Pie",
            "description": "Macadamia Nut Pie is a rich dessert, featuring a buttery crust filled with a sweet, nutty mixture of macadamia nuts and caramel."
        }
    },
    {
        "country": "Mauritania",
        "dishes": [
            {
                "name": "Thieboudienne",
                "description": "Thieboudienne is a fish and rice dish, often cooked with tomatoes and vegetables, known for its hearty and savory flavor."
            },
            {
                "name": "Mechoui",
                "description": "Mechoui is roasted lamb, traditionally cooked whole and seasoned with a blend of spices, celebrated for its tender and flavorful meat."
            },
            {
                "name": "Ngomou",
                "description": "Ngomou is a meat and vegetable stew, featuring a rich broth and a variety of local spices, known for its comforting and nourishing qualities."
            }
        ],
        "dessert": {
            "name": "Mahkroub",
            "description": "Mahkroub is a sweet semolina cake, often flavored with honey and spices, enjoyed for its moist texture and sweet taste."
        }
    },
    {
        "country": "Mauritius",
        "dishes": [
            {
                "name": "Dholl Puri",
                "description": "Dholl Puri is a lentil flatbread, typically served with a variety of chutneys and curries, known for its soft texture and flavorful fillings."
            },
            {
                "name": "Rougaille",
                "description": "Rougaille is a tomato-based sauce, often cooked with meat or fish, celebrated for its rich, tangy flavor and aromatic spices."
            },
            {
                "name": "Mine Frite",
                "description": "Mine Frite is a dish of fried noodles, often stir-fried with vegetables, meat, and a savory sauce, known for its satisfying and flavorful taste."
            }
        ],
        "dessert": {
            "name": "Napolitaine",
            "description": "Napolitaine are shortbread cookies filled with jam, often coated with a sweet glaze, enjoyed for their rich and buttery flavor."
        }
    },
    {
        "country": "Mexico",
        "dishes": [
            {
                "name": "Tacos",
                "description": "Tacos are a versatile dish consisting of a tortilla filled with various ingredients such as meat, beans, and vegetables, known for their bold and diverse flavors."
            },
            {
                "name": "Mole Poblano",
                "description": "Mole Poblano is a rich sauce made with chocolate and chili peppers, typically served with meat, celebrated for its complex and savory-sweet flavor."
            },
            {
                "name": "Chiles en Nogada",
                "description": "Chiles en Nogada are stuffed peppers covered with a walnut sauce, often garnished with pomegranate seeds, known for their festive appearance and unique blend of flavors."
            }
        ],
        "dessert": {
            "name": "Tres Leches Cake",
            "description": "Tres Leches Cake is a sponge cake soaked in three kinds of milk, enjoyed for its moist texture and sweet, creamy flavor."
        }
    },
    {
        "country": "Micronesia",
        "dishes": [
            {
                "name": "Taro",
                "description": "Taro is a root vegetable, often boiled or baked, known for its starchy texture and mild, nutty flavor, commonly served as a side dish."
            },
            {
                "name": "Breadfruit",
                "description": "Breadfruit is a starchy fruit, usually roasted or boiled, celebrated for its versatility and slightly sweet, potato-like taste."
            },
            {
                "name":
    
     "Fish with Coconut Sauce",
                "description": "Fish with Coconut Sauce is a dish where fish is cooked in a creamy coconut sauce, known for its rich and tropical flavor."
            }
        ],
        "dessert": {
            "name": "Banana Cake",
            "description": "Banana Cake is a moist and sweet cake made with ripe bananas, often flavored with cinnamon and nuts."
        }
    },
    {
        "country": "Moldova",
        "dishes": [
            {
                "name": "Mamaliga",
                "description": "Mamaliga is a cornmeal porridge, similar to polenta, known for its simple, hearty flavor and often served with cheese and sour cream."
            },
            {
                "name": "Placinta",
                "description": "Placinta is a savory pastry, typically filled with cheese, potatoes, or cabbage, enjoyed for its flaky crust and flavorful fillings."
            },
            {
                "name": "Zeama",
                "description": "Zeama is a traditional chicken soup, often made with homemade noodles and flavored with dill, celebrated for its comforting and nourishing qualities."
            }
        ],
        "dessert": {
            "name": "Colțunași",
            "description": "Colțunași are dumplings filled with sweet ingredients such as cherries or cottage cheese, known for their tender dough and delightful fillings."
        }
    },
    {
        "country": "Monaco",
        "dishes": [
            {
                "name": "Barbajuans",
                "description": "Barbajuans are fried pastries filled with ricotta and spinach, known for their crispy exterior and savory, cheesy filling."
            },
            {
                "name": "Stocafi",
                "description": "Stocafi is a dish of salt cod cooked in a rich tomato sauce, celebrated for its hearty and flavorful taste."
            },
            {
                "name": "Socca",
                "description": "Socca is a chickpea flatbread, typically enjoyed as a snack, known for its crisp edges and soft, slightly nutty interior."
            }
        ],
        "dessert": {
            "name": "Fougasse",
            "description": "Fougasse is a sweet bread often flavored with nuts and orange, enjoyed for its soft texture and rich, aromatic flavor."
        }
    },
    {
        "country": "Mongolia",
        "dishes": [
            {
                "name": "Buuz",
                "description": "Buuz are steamed dumplings filled with meat, typically mutton or beef, known for their juicy and savory filling."
            },
            {
                "name": "Khorkhog",
                "description": "Khorkhog is a traditional Mongolian barbecue, where meat is cooked with hot stones, celebrated for its tender meat and unique smoky flavor."
            },
            {
                "name": "Tsuivan",
                "description": "Tsuivan is a stir-fried noodle dish, often cooked with meat and vegetables, known for its hearty and flavorful taste."
            }
        ],
        "dessert": {
            "name": "Boortsog",
            "description": "Boortsog are fried dough treats, enjoyed for their crispy exterior and soft, sweet interior, often served with tea."
        }
    },
    {
        "country": "Montenegro",
        "dishes": [
            {
                "name": "Njeguški Pršut",
                "description": "Njeguški Pršut is a type of smoked ham, known for its rich, savory flavor and delicate, tender texture."
            },
            {
                "name": "Kačamak",
                "description": "Kačamak is a dish made from polenta, cheese, and cream, celebrated for its creamy texture and hearty, comforting taste."
            },
            {
                "name": "Cicvara",
                "description": "Cicvara is a cheese and cornmeal dish, known for its rich and creamy consistency and savory flavor."
            }
        ],
        "dessert": {
            "name": "Priganice",
            "description": "Priganice are fried dough treats, enjoyed for their soft, fluffy texture and sweet, comforting flavor."
        }
    },
    {
        "country": "Morocco",
        "dishes": [
            {
                "name": "Tagine",
                "description": "Tagine is a slow-cooked stew made with meat, vegetables, and aromatic spices, traditionally cooked in a clay pot, known for its rich and complex flavor."
            },
            {
                "name": "Couscous",
                "description": "Couscous is steamed semolina served with meat and vegetables, celebrated for its light, fluffy texture and ability to absorb the flavors of the accompanying stew."
            },
            {
                "name": "Harira",
                "description": "Harira is a tomato and lentil soup, often enjoyed during Ramadan, known for its hearty and nourishing qualities."
            }
        ],
        "dessert": {
            "name": "Chebakia",
            "description": "Chebakia are sesame cookies coated in honey, enjoyed for their crunchy texture and sweet, spiced flavor."
        }
    },
    {
        "country": "Mozambique",
        "dishes": [
            {
                "name": "Piri Piri Chicken",
                "description": "Piri Piri Chicken is a spicy grilled chicken dish, marinated with piri piri sauce, known for its fiery flavor and tender meat."
            },
            {
                "name": "Matapa",
                "description": "Matapa is a dish made with cassava leaves cooked in coconut milk, often with peanuts and shrimp, celebrated for its rich and creamy flavor."
            },
            {
                "name": "Xima",
                "description": "Xima is a thick maize porridge, similar to polenta, known for its versatility as a base for various savory dishes."
            }
        ],
        "dessert": {
            "name": "Bolo Polana",
            "description": "Bolo Polana is a cake made from cashews and potatoes, enjoyed for its moist and dense texture and unique flavor."
        }
    },
    {
        "country": "Myanmar (Burma)",
        "dishes": [
            {
                "name": "Mohinga",
                "description": "Mohinga is a fish soup with rice noodles, often considered the national dish of Myanmar, known for its savory broth and aromatic spices."
            },
            {
                "name": "Laphet Thoke",
                "description": "Laphet Thoke is a fermented tea leaf salad, typically mixed with nuts, sesame seeds, and garlic, celebrated for its unique and tangy flavor."
            },
            {
                "name": "Shan Noodles",
                "description": "Shan Noodles are rice noodles served with chicken or pork, known for their light and savory flavor, often garnished with fresh herbs."
            }
        ],
        "dessert": {
            "name": "Shwe Yin Aye",
            "description": "Shwe Yin Aye is a coconut milk dessert, often made with sago, agar jelly, and various fruits, enjoyed for its refreshing and sweet taste."
        }
    },
    {
        "country": "Namibia",
        "dishes": [
            {
                "name": "Potjiekos",
                "description": "Potjiekos is a meat and vegetable stew, slow-cooked in a cast-iron pot, known for its rich and hearty flavor."
            },
            {
                "name": "Biltong",
                "description": "Biltong is dried cured meat, similar to jerky, enjoyed for its chewy texture and savory, slightly spiced flavor."
            },
            {
                "name": "Kapana",
                "description": "Kapana is a popular street food, consisting of grilled meat, known for its smoky flavor and often served with spicy sauces."
            }
        ],
        "dessert": {
            "name": "Malva Pudding",
            "description": "Malva Pudding is a sweet sponge pudding, often served with a caramelized sauce, celebrated for its moist texture and rich flavor."
        }
    },
    {
        "country": "Nauru",
        "dishes": [
            {
                "name": "Coconut Fish",
                "description": "Coconut Fish is a dish where fish is cooked in a coconut-based sauce, known for its rich and tropical flavor."
            },
            {
                "name": "Fried Rice",
                "description": "Fried Rice is a versatile dish, often made with a mix of vegetables, meat, and soy sauce, celebrated for its savory and satisfying taste."
            },
            {
                "name": "Taro",
                "description": "Taro is a starchy root vegetable, often boiled or baked, known for its slightly sweet and nutty flavor."
            }
        ],
        "dessert": {
            "name": "Coconut Custard",
            "description": "Coconut Custard is a rich dessert made with coconut milk and eggs, enjoyed for its creamy texture and sweet, tropical taste."
        }
    },
    {
        "country": "Nepal",
        "dishes": [
            {
                "name": "Dal Bhat",
                "description": "Dal Bhat is a traditional meal consisting of lentil soup and rice, known for its simple yet nutritious and flavorful combination."
            },
            {
                "name": "Momo",
                "description": "Momo are steamed dumplings, typically filled with meat or vegetables, celebrated for their juicy and savory filling."
            },
            {
                "name": "Gundruk",
                "description": "Gundruk is a dish made from fermented leafy greens, known for its tangy flavor and often used as a side dish or ingredient in stews."
            }
        ],
       
    
     "dessert": {
            "name": "Sel Roti",
            "description": "Sel Roti is a traditional rice doughnut, enjoyed for its sweet and crispy exterior and soft, chewy interior."
        }
    },
    {
        "country": "Netherlands",
        "dishes": [
            {
                "name": "Stamppot",
                "description": "Stamppot is a hearty dish of mashed potatoes mixed with vegetables like kale or carrots, known for its comforting and savory flavor."
            },
            {
                "name": "Bitterballen",
                "description": "Bitterballen are fried meatballs, often served as a snack, celebrated for their crispy exterior and creamy, savory filling."
            },
            {
                "name": "Haring",
                "description": "Haring is raw herring, typically eaten with onions and pickles, known for its fresh and slightly salty taste."
            }
        ],
        "dessert": {
            "name": "Stroopwafel",
            "description": "Stroopwafel is a waffle cookie filled with caramel syrup, enjoyed for its chewy texture and sweet, rich flavor."
        }
    },
    {
        "country": "New Zealand",
        "dishes": [
            {
                "name": "Hāngi",
                "description": "Hāngi is a traditional Māori dish where meat and vegetables are cooked in an earth oven, known for its smoky flavor and tender texture."
            },
            {
                "name": "Fish and Chips",
                "description": "Fish and Chips are a popular dish, consisting of battered and fried fish served with crispy fries, celebrated for its crunchy and savory taste."
            },
            {
                "name": "Roast Lamb",
                "description": "Roast Lamb is a traditional dish, known for its succulent meat and delicious flavor, often served with mint sauce."
            }
        ],
        "dessert": {
            "name": "Pavlova",
            "description": "Pavlova is a meringue dessert, enjoyed for its crisp crust and soft, light inside, often topped with fruit and whipped cream."
        }
    },
    {
        "country": "Nicaragua",
        "dishes": [
            {
                "name": "Gallo Pinto",
                "description": "Gallo Pinto is a traditional dish of rice and beans, known for its savory flavor and often enjoyed as a hearty breakfast."
            },
            {
                "name": "Nacatamal",
                "description": "Nacatamal is a traditional corn dough filled with meat and vegetables, wrapped in banana leaves and steamed, celebrated for its rich and comforting taste."
            },
            {
                "name": "Vigorón",
                "description": "Vigorón is a dish of yucca topped with pork and a tangy cabbage salad, known for its flavorful and refreshing combination."
            }
        ],
        "dessert": {
            "name": "Tres Leches Cake",
            "description": "Tres Leches Cake is a sponge cake soaked in three kinds of milk, enjoyed for its moist texture and sweet, creamy flavor."
        }
    },
    {
        "country": "Niger",
        "dishes": [
            {
                "name": "Jollof Rice",
                "description": "Jollof Rice is a spiced rice dish cooked with tomatoes, onions, and various spices, often combined with meat, creating a flavorful and aromatic meal."
            },
            {
                "name": "Djerma Stew",
                "description": "Djerma Stew is a hearty stew made with meat and vegetables, seasoned with traditional spices, offering a rich and comforting flavor."
            },
            {
                "name": "Fufu",
                "description": "Fufu is a starchy side dish made from pounded yam or cassava, known for its smooth texture and subtle flavor, typically served with soups and stews."
            }
        ],
        "dessert": {
            "name": "Degue",
            "description": "Degue is a dessert made from millet couscous mixed with sweetened yogurt, offering a creamy and slightly tangy flavor."
        }
    },
    {
        "country": "Nigeria",
        "dishes": [
            {
                "name": "Jollof Rice",
                "description": "Jollof Rice is a beloved West African dish of spiced rice cooked with tomatoes, onions, and peppers, often served with chicken, beef, or fish."
            },
            {
                "name": "Pounded Yam with Egusi Soup",
                "description": "Pounded Yam is a smooth, dough-like side dish made from yam, typically served with Egusi Soup, a thick soup made from melon seeds, vegetables, and meat."
            },
            {
                "name": "Suya",
                "description": "Suya is a popular Nigerian street food consisting of spicy grilled meat skewers, seasoned with a blend of ground peanuts, chili, and spices."
            }
        ],
        "dessert": {
            "name": "Puff-Puff",
            "description": "Puff-Puff are deep-fried dough balls, slightly sweet and fluffy, often enjoyed as a snack or dessert."
        }
    },
    {
        "country": "North Macedonia",
        "dishes": [
            {
                "name": "Tavče Gravče",
                "description": "Tavče Gravče is a traditional bean stew cooked with onions, peppers, and spices, known for its rich and comforting flavor."
            },
            {
                "name": "Ajvar",
                "description": "Ajvar is a pepper-based relish made from roasted red peppers, eggplant, and garlic, celebrated for its sweet and smoky taste."
            },
            {
                "name": "Kebapi",
                "description": "Kebapi are small, grilled minced meat sausages, typically made from beef and lamb, known for their savory and slightly spicy flavor."
            }
        ],
        "dessert": {
            "name": "Tulumba",
            "description": "Tulumba are fried dough pastries soaked in syrup, enjoyed for their sweet, crispy exterior and soft, syrupy interior."
        }
    },
    {
        "country": "Norway",
        "dishes": [
            {
                "name": "Lutefisk",
                "description": "Lutefisk is dried fish, usually cod, reconstituted in lye and water, then cooked and served with butter, potatoes, and peas, known for its unique gelatinous texture."
            },
            {
                "name": "Kjøttkaker",
                "description": "Kjøttkaker are Norwegian meatballs made from minced meat, typically beef or pork, mixed with spices and onions, often served with potatoes, gravy, and lingonberry jam."
            },
            {
                "name": "Rakfisk",
                "description": "Rakfisk is fermented fish, usually trout, served with flatbread, potatoes, onions, and sour cream, celebrated for its pungent and tangy flavor."
            }
        ],
        "dessert": {
            "name": "Krumkake",
            "description": "Krumkake are delicate waffle cookies, rolled into cone shapes and often filled with whipped cream or fruit, enjoyed for their crispy texture and sweet flavor."
        }
    },
    {
        "country": "Oman",
        "dishes": [
            {
                "name": "Shuwa",
                "description": "Shuwa is a slow-cooked lamb dish marinated with a blend of spices and wrapped in banana leaves, then cooked in an underground sand oven, known for its tender and flavorful meat."
            },
            {
                "name": "Majboos",
                "description": "Majboos is a spiced rice dish cooked with meat, typically lamb or chicken, and flavored with a blend of spices, tomatoes, and onions, offering a rich and aromatic taste."
            },
            {
                "name": "Mashuai",
                "description": "Mashuai is a dish featuring grilled kingfish served with rice, known for its delicate flavor and tender texture, often seasoned with lemon and spices."
            }
        ],
        "dessert": {
            "name": "Halwa",
            "description": "Halwa is a sweet, gelatinous dessert made from sugar, rose water, and various nuts, enjoyed for its rich, aromatic flavor and chewy texture."
        }
    },
    {
        "country": "Pakistan",
        "dishes": [
            {
                "name": "Biryani",
                "description": "Biryani is a spiced rice dish cooked with layers of marinated meat, basmati rice, and aromatic spices, known for its rich and flavorful taste."
            },
            {
                "name": "Nihari",
                "description": "Nihari is a slow-cooked beef stew, seasoned with a blend of spices and served with naan or rice, celebrated for its hearty and aromatic flavor."
            },
            {
                "name": "Karahi",
                "description": "Karahi is a spicy meat stew, typically made with chicken or mutton, cooked with tomatoes, green chilies, and spices, known for its robust and tangy flavor."
            }
        ],
        "dessert": {
            "name": "Gulab Jamun",
            "description": "Gulab Jamun are milk solid-based sweets, deep-fried and soaked in sugar syrup, enjoyed for their soft, spongy texture and sweet flavor."
        }
    },
    {
        "country": "Palau",
        "dishes": [
            {
                "name": "Tinola",
                "description": "Tinola is a chicken soup made with ginger, green papaya, and spinach, known for its light and comforting flavor."
            },
            {
                "name": "Fruit Bat Soup",
                "description": "Fruit Bat Soup is a traditional Palauan dish made with fruit bat, known for its unique flavor and cultural significance."
            },
            {
                "name": "Ulkoy",
                "description": "Ulkoy are shrimp fritters made with a batter of flour, eggs, and spices, fried until crispy, enjoyed for their savory and crunchy texture."
            }
        ],
        "dessert": {
            "name": "Taro Pudding",
            "description": "Taro Pudding is a creamy dessert made from taro root, coconut milk, and sugar, known for its smooth texture and sweet, nutty flavor."
        }
    },
    {
        "country": "Panama",
        "dishes": [
            {
                "name": "Sancocho",
                "description": "Sancocho is a hearty chicken soup made with root vegetables, corn, and cilantro, celebrated for its rich and comforting flavor."
            },
            {
                "name": "Ropa Vieja",
                "description": "Ropa Vieja is a dish of shredded beef cooked with tomatoes, onions, and peppers, known for its savory and robust flavor."
            },
            {
                "name": "Arroz con Pollo",
                "description": "Arroz con Pollo is a flavorful dish of rice cooked with chicken, vegetables, and spices, enjoyed for its aromatic and satisfying taste."
            }
        ],
        "dessert": {
            "name": "Tres Leches Cake",
            "description": "Tres Leches Cake is a sponge cake soaked in three types of milk (evaporated milk, condensed milk, and heavy cream), enjoyed for its moist texture and sweet, creamy flavor."
        }
    },
    {
        "country": "Papua New Guinea",
        "dishes": [
            {
                "name": "Mumu",
                "description": "Mumu is a traditional dish where meat and vegetables are cooked in an earth oven, known for its smoky flavor and tender texture."
            },
            {
                "name": "Kokoda",
                "description": "Kokoda is a dish of raw fish marinated in coconut milk and lime juice, celebrated for its fresh and tangy flavor."
            },
            {
                "name": "Kaukau",
                "description": "Kaukau is a dish made from sweet potatoes, often roasted or boiled, enjoyed for its naturally sweet and hearty taste."
            }
        ],
        "dessert": {
            "name": "Sago Pudding",
            "description": "Sago Pudding is a dessert made from sago pearls cooked with coconut milk and sugar, known for its creamy texture and subtle sweetness."
        }
    },
    {
        "country": "Paraguay",
        "dishes": [
            {
                "name": "Sopa Paraguaya",
                "description": "Sopa Paraguaya is a cornbread made with cheese, onions, and cornmeal, celebrated for its rich and savory flavor."
            },
            {
                "name": "Chipa",
                "description": "Chipa are small, round breads made from manioc flour and cheese, known for their chewy texture and cheesy taste."
            },
            {
                "name": "Bori-Bori",
                "description": "Bori-Bori is a soup made with dumplings of cornmeal and cheese, combined with chicken or beef, enjoyed for its comforting and hearty flavor."
            }
        ],
        "dessert": {
            "name": "Dulce de Mamón",
            "description": "Dulce de Mamón is a sweet preserve made from papaya, cooked with sugar and cloves, known for its rich and sweet flavor."
        }
    },
    {
        "country": "Peru",
        "dishes": [
            {
                "name": "Ceviche",
                "description": "Ceviche is a dish of raw fish marinated in lime juice, mixed with onions, cilantro, and chili peppers, celebrated for its fresh and zesty flavor."
            },
            {
                "name": "Lomo Saltado",
                "description": "Lomo Saltado is a stir-fry dish of beef, tomatoes, onions, and fries, known for its fusion of Peruvian and Asian flavors."
            },
            {
                "name": "Aji de Gallina",
                "description": "Aji de Gallina is a dish of shredded chicken cooked in a creamy, spicy sauce made from aji peppers, walnuts, and cheese, enjoyed for its rich and flavorful taste."
            }
        ],
        "dessert": {
            "name": "Picarones",
            "description": "Picarones are deep-fried doughnuts made from squash and sweet potatoes, drizzled with syrup, known for their sweet and slightly spiced flavor."
        }
    },
    {
        "country": "Philippines",
        "dishes": [
            {
                "name": "Adobo",
                "description": "Adobo is a marinated meat stew, typically made with chicken or pork, simmered in vinegar, soy sauce, garlic, and spices, known for its tangy and savory flavor."
            },
            {
                "name": "Sinigang",
                "description": "Sinigang is a sour soup made with tamarind, tomatoes, and various meats or seafood, celebrated for its tangy and comforting taste."
            },
            {
                "name": "Lechon",
                "description": "Lechon is a roast pig, often served at celebrations, known for its crispy skin and tender, flavorful meat."
            }
        ],
        "dessert": {
            "name": "Halo-Halo",
            "description": "Halo-Halo is a mixed dessert with shaved ice, sweetened beans, fruits, and topped with leche flan and ube ice cream, enjoyed for its refreshing and varied flavors."
        }
    },
    {
        "country": "Poland",
        "dishes": [
            {
                "name": "Pierogi",
                "description": "Pierogi are dumplings filled with various ingredients like potatoes, cheese, meat, or fruit, known for their soft dough and flavorful fillings."
            },
            {
                "name": "Bigos",
                "description": "Bigos, also known as hunter's stew, is a hearty dish made with sauerkraut, fresh cabbage, various meats, and spices, celebrated for its rich and savory flavor."
            },
            {
                "name": "Kielbasa",
                "description": "Kielbasa is a type of sausage made from pork or a combination of meats, seasoned with garlic and other spices, enjoyed for its smoky and savory taste."
            }
        ],
        "dessert": {
            "name": "Sernik",
            "description": "Sernik is a traditional cheesecake made with a sweet, creamy filling of farmer's cheese, known for its rich and tangy flavor."
        }
    },
    {
        "country": "Portugal",
        "dishes": [
            {
                "name": "Bacalhau à Brás",
                "description": "Bacalhau à Brás is a dish of shredded salt cod, mixed with onions, potatoes, and eggs, known for its savory and comforting flavor."
            },
            {
                "name": "Caldo Verde",
                "description": "Caldo Verde is a traditional soup made with kale, potatoes, and chorizo, celebrated for its hearty and flavorful taste."
            },
            {
                "name": "Frango Piri Piri",
                "description": "Frango Piri Piri is a spicy chicken dish marinated with piri piri sauce, known for its tangy and fiery flavor."
            }
        ],
        "dessert": {
            "name": "Pastel de Nata",
            "description": "Pastel de Nata is a custard tart with a crispy, flaky crust and a creamy custard filling, enjoyed for its sweet and rich flavor."
        }
    },
    {
        "country": "Qatar",
        "dishes": [
            {
                "name": "Machboos",
                "description": "Machboos is a spiced rice dish cooked with meat, typically lamb or chicken, and flavored with a blend of spices, tomatoes, and onions, offering a rich and aromatic taste."
            },
            {
                "name": "Harees",
                "description": "Harees is a porridge made from cracked wheat and meat, known for its smooth texture and hearty flavor."
            },
            {
                "name": "Thareed",
                "description": "Thareed is a bread and meat stew, where pieces of flatbread are soaked in a flavorful broth with meat and vegetables, celebrated for its comforting taste."
            }
        ],
        "dessert": {
            "name": "Luqaimat",
            "description": "Luqaimat are sweet dumplings made from a dough of flour, yeast, and sugar, fried until golden and drizzled with honey or syrup, enjoyed for their crispy exterior and soft, sweet interior."
        }
    },
    {
        "country": "Romania",
        "dishes": [
            {
                "name": "Sarmale",
                "description": "Sarmale are stuffed cabbage rolls filled with a mixture of ground meat, rice, and spices, simmered in a tomato-based sauce, known for their savory and hearty flavor."
            },
            {
                "name": "Mici",
                "description": "Mici are grilled minced meat rolls made from a blend of beef, pork, and spices, enjoyed for their juicy and flavorful taste."
            },
            {
                "name": "Ciorbă",
                "description": "Ciorbă is a traditional sour soup made with meat, vegetables, and a souring agent like lemon juice or vinegar, celebrated for its tangy and refreshing flavor."
            }
        ],
        "dessert": {
            "name": "Papanasi",
            "description": "Papanasi are fried doughnuts filled with sweet cheese and topped with sour cream and jam, known for their rich and indulgent flavor."
        }
    },
    {
        "country": "Russia",
        "dishes": [
            {
                "name": "Borscht",
                "description": "Borscht is a beet soup made with beets, cabbage, potatoes, and meat, known for its vibrant color and sweet, earthy flavor."
            },
            {
                "name": "Pelmeni",
                "description": "Pelmeni are dumplings filled with minced meat, typically served with sour cream or in a broth, enjoyed for their tender dough and savory filling."
            },
            {
                "name": "Beef Stroganoff",
                "description": "Beef Stroganoff is a dish of sautéed beef strips cooked in a creamy sauce with onions and mushrooms, celebrated for its rich and savory flavor."
            }
        ],
        "dessert": {
            "name": "Syrniki",
            "description": "Syrniki are cheese pancakes made from farmer's cheese, eggs, and flour, often served with sour cream, jam, or honey, known for their sweet and tangy flavor."
        }
    },
    {
        "country": "Rwanda",
        "dishes": [
            {
                "name": "Ugali",
                "description": "Ugali is a maize porridge, typically served as a side dish to stews and vegetables, known for its smooth texture and subtle flavor."
            },
            {
                "name": "Isombe",
                "description": "Isombe is a dish made from cassava leaves cooked with peanuts, offering a rich and slightly nutty flavor."
            },
            {
                "name": "Brochettes",
                "description": "Brochettes are skewered and grilled meat, often marinated with spices, celebrated for their smoky and savory taste."
            }
        ],
        "dessert": {
            "name": "Akabenz",
            "description": "Akabenz is grilled pork, known for its rich and savory flavor, often enjoyed as a popular street food."
        }
    },
    {
        "country": "Saint Kitts and Nevis",
        "dishes": [
            {
                "name": "Goat Water",
                "description": "Goat Water is a goat stew made with goat meat, breadfruit, and spices, known for its rich and hearty flavor."
            },
            {
                "name": "Saltfish and Dumplings",
                "description": "Saltfish and Dumplings is a traditional dish featuring salted fish served with boiled dumplings, celebrated for its savory and comforting taste."
            },
            {
                "name": "Pelau",
                "description": "Pelau is a one-pot dish of rice and peas cooked with meat, typically chicken or pork, offering a flavorful and satisfying meal."
            }
        ],
        "dessert": {
            "name": "Guava Cheese",
            "description": "Guava Cheese is a sweet confection made from guava paste, enjoyed for its chewy texture and sweet, fruity flavor."
        }
    },
    {
        "country": "Saint Lucia",
        "dishes": [
            {
                "name": "Green Fig and Saltfish",
                "description": "Green Fig and Saltfish is a dish of green bananas cooked with salted fish, known for its savory and slightly sweet flavor."
            },
            {
                "name": "Bouyon",
                "description": "Bouyon is a hearty soup made with meat, vegetables, and spices, celebrated for its rich and comforting taste."
            },
            {
                "name": "Accra",
                "description": "Accra are fish fritters made from salted fish mixed with flour and spices, fried until crispy, enjoyed for their savory and crunchy texture."
            }
        ],
        "dessert": {
            "name": "Coconut Cake",
            "description": "Coconut Cake is a sweet cake made with grated coconut, known for its moist texture and rich, tropical flavor."
        }
    },
    {
        "country": "Saint Vincent and the Grenadines",
        "dishes": [
            {
                "name": "Roasted Breadfruit and Jackfish",
                "description": "Roasted Breadfruit and Jackfish is a traditional dish featuring roasted breadfruit served with fried jackfish, celebrated for its savory and hearty flavor."
            },
            {
                "name": "Callaloo Soup",
                "description": "Callaloo Soup is a soup made from callaloo leaves, often combined with okra, pumpkin, and coconut milk, known for its rich and flavorful taste."
            },
            {
                "name": "Fungi",
                "description": "Fungi is a cornmeal dish, often served as a side to stews and soups, enjoyed for its smooth texture and subtle flavor."
            }
        ],
        "dessert": {
            "name": "Cassava Pone",
            "description": "Cassava Pone is a cake made from grated cassava, coconut, and spices, known for its moist texture and rich, sweet flavor."
        }
    },
    {
        "country": "Samoa",
        "dishes": [
            {
                "name": "Palusami",
                "description": "Palusami is a dish of taro leaves cooked with coconut cream, often with added onions and corned beef, celebrated for its creamy and savory flavor."
            },
            {
                "name": "Oka",
                "description": "Oka is a dish of raw fish marinated in coconut milk and lime juice, known for its fresh and tangy flavor."
            },
            {
                "name": "Faiai Eleni",
                "description": "Faiai Eleni is a dish of fish cooked in coconut cream, often with onions and lemon juice, enjoyed for its rich and creamy taste."
            }
        ],
        "dessert": {
            "name": "Panikeke",
            "description": "Panikeke are banana fritters, known for their sweet and fluffy texture, often enjoyed as a dessert or snack."
        }
    },
    {
        "country": "San Marino",
        "dishes": [
            {
                "name": "Nidi di Rondine",
                "description": "Nidi di Rondine is a pasta dish made with rolled pasta filled with cheese, ham, and tomatoes, baked in a creamy sauce, known for its rich and savory flavor."
            },
            {
                "name": "Fagioli con le Cotiche",
                "description": "Fagioli con le Cotiche is a bean soup made with pork rinds, tomatoes, and spices, celebrated for its hearty and comforting taste."
            },
            {
                "name": "Piadina",
                "description": "Piadina is an Italian flatbread, typically filled with cheese, meats, and vegetables, known for its soft texture and delicious fillings."
            }
        ],
        "dessert": {
            "name": "Torta Tre Monti",
            "description": "Torta Tre Monti is a layered wafer cake filled with hazelnut cream, known for its crispy layers and rich, nutty flavor."
        }
    },
    {
        "country": "São Tomé and Príncipe",
        "dishes": [
            {
                "name": "Calulu",
                "description": "Calulu is a fish or chicken stew cooked with vegetables and palm oil, known for its rich and savory flavor."
            },
            {
                "name": "Feijoada",
                "description": "Feijoada is a bean stew made with various meats, celebrated for its hearty and flavorful taste."
            },
            {
                "name": "Grilled Fish with Banana",
                "description": "Grilled Fish with Banana is a dish of fish grilled with spices and served with bananas, enjoyed for its unique and complementary flavors."
            }
        ],
        "dessert": {
            "name": "Banana Fritters",
            "description": "Banana Fritters are sweet, fried treats made from mashed bananas and flour, known for their crispy exterior and soft, sweet interior."
        }
    },
    {
        "country": "Saudi Arabia",
        "dishes": [
            {
                "name": "Kabsa",
                "description": "Kabsa is a spiced rice dish cooked with meat, typically lamb or chicken, and flavored with a blend of spices, tomatoes, and onions, offering a rich and aromatic taste."
            },
            {
                "name": "Jareesh",
                "description": "Jareesh is a dish made from cracked wheat cooked with meat, known for its smooth texture and hearty flavor."
            },
            {
                "name": "Mandi",
                "description": "Mandi is a dish of rice cooked with meat and spices, traditionally cooked in an underground oven, celebrated for its tender meat and fragrant rice."
            }
        ],
        "dessert": {
            "name": "Basbousa",
            "description": "Basbousa is a semolina cake soaked in syrup, often flavored with rose water or orange blossom, known for its moist texture and sweet, aromatic flavor."
        }
    },
    {
        "country": "Senegal",
        "dishes": [
            {
                "name": "Thieboudienne",
                "description": "Thieboudienne is a dish of fish and rice cooked with tomatoes, vegetables, and spices, celebrated for its rich and savory flavor."
            },
            {
                "name": "Yassa Poulet",
                "description": "Yassa Poulet is a dish of chicken marinated with onions, lemon, and mustard, known for its tangy and flavorful taste."
            },
            {
                "name": "Maafe",
                "description": "Maafe is a peanut stew made with meat, typically chicken or beef, and vegetables, enjoyed for its rich and nutty flavor."
            }
        ],
        "dessert": {
            "name": "Thiakry",
            "description": "Thiakry is a millet pudding mixed with sweetened milk and spices, known for its creamy texture and sweet, aromatic flavor."
        }
    },
    {
        "country": "Serbia",
        "dishes": [
            {
                "name": "Ćevapi",
                "description": "Ćevapi are grilled minced meat sausages, typically made from a mix of beef and lamb, known for their smoky and savory flavor."
            },
            {
                "name": "Sarma",
                "description": "Sarma are stuffed cabbage rolls filled with minced meat, rice, and spices, simmered in a tomato-based sauce, enjoyed for their hearty and comforting taste."
            },
            {
                "name": "Karadjordjeva Šnicla",
                "description": "Karadjordjeva Šnicla is a breaded rolled meat dish filled with cheese, often served with fries and tartar sauce, known for its rich and indulgent flavor."
            }
        ],
        "dessert": {
            "name": "Krofne",
            "description": "Krofne are doughnuts, often filled with jam or chocolate, and dusted with powdered sugar, known for their soft and sweet taste."
        }
    },
    {
        "country": "Seychelles",
        "dishes": [
            {
                "name": "Fish Curry",
                "description": "Fish Curry is a dish of fish cooked in a blend of spices and coconut milk, known for its rich and creamy flavor."
            },
            {
                "name": "Octopus Curry",
                "description": "Octopus Curry is a dish of octopus simmered in a spicy coconut milk sauce, celebrated for its tender texture and flavorful sauce."
            },
            {
                "name": "Ladob",
                "description": "Ladob is a dish of breadfruit cooked with coconut milk, known for its rich and creamy taste."
            }
        ],
        "dessert": {
            "name": "Coconut Nougat",
            "description": "Coconut Nougat is a sweet treat made from grated coconut and sugar, often shaped into bars, enjoyed for its chewy texture and sweet, tropical flavor."
        }
    },
    {
        "country": "Sierra Leone",
        "dishes": [
            {
                "name": "Jollof Rice",
                "description": "Jollof Rice is a spiced rice dish cooked with tomatoes, onions, and various spices, often combined with meat, creating a flavorful and aromatic meal."
            },
            {
                "name": "Groundnut Stew",
                "description": "Groundnut Stew is a rich stew made with peanuts, meat, and vegetables, known for its hearty and nutty flavor."
            },
            {
                "name": "Cassava Leaves",
                "description": "Cassava Leaves are cooked with meat and spices to create a flavorful and nutritious dish, enjoyed for its savory and slightly bitter taste."
            }
        ],
        "dessert": {
            "name": "Ginger Cake",
            "description": "Ginger Cake is a moist cake flavored with ginger and other spices, known for its warm and aromatic taste."
        }
    },
    {
        "country": "Singapore",
        "dishes": [
            {
                "name": "Hainanese Chicken Rice",
                "description": "Hainanese Chicken Rice is a dish of poached chicken served with fragrant rice, accompanied by chili sauce and ginger paste, celebrated for its simple yet flavorful taste."
            },
            {
                "name": "Chili Crab",
                "description": "Chili Crab is a seafood dish of crab cooked in a sweet and spicy tomato-based sauce, known for its rich and tangy flavor."
            },
            {
                "name": "Laksa",
                "description": "Laksa is a spicy noodle soup made with a coconut milk base, often containing shrimp or chicken, known for its aromatic and spicy taste."
            }
        ],
        "dessert": {
            "name": "Pandan Cake",
            "description": "Pandan Cake is a light and fluffy chiffon cake flavored with pandan juice, known for its bright green color and fragrant, sweet taste."
        }
    },
    {
        "country": "Slovakia",
        "dishes": [
            {
                "name": "Bryndzové Halušky",
                "description": "Bryndzové Halušky are potato dumplings served with sheep cheese and often topped with bacon, known for their rich and creamy flavor."
            },
            {
                "name": "Kapustnica",
                "description": "Kapustnica is a sauerkraut soup made with smoked meat and sausages, celebrated for its tangy and hearty taste."
            },
            {
                "name": "Zemiakové Placky",
                "description": "Zemiakové Placky are potato pancakes fried until crispy, enjoyed for their savory and crunchy texture."
            }
        ],
        "dessert": {
            "name": "Skalický Trdelník",
            "description": "Skalický Trdelník is a sweet pastry rolled in sugar and nuts, baked on a spit, known for its crispy exterior and soft, sweet interior."
        }
    },
    {
        "country": "Slovenia",
        "dishes": [
            {
                "name": "Kranjska Klobasa",
                "description": "Kranjska Klobasa is a Carniolan sausage made from pork, seasoned with garlic and pepper, known for its savory and smoky flavor."
            },
            {
                "name": "Potica",
                "description": "Potica is a rolled pastry filled with nuts, poppy seeds, or other fillings, celebrated for its sweet and rich taste."
            },
            {
                "name": "Bograč",
                "description": "Bograč is a meat stew made with various meats, potatoes, and spices, known for its hearty and flavorful taste."
            }
        ],
        "dessert": {
            "name": "Prekmurska Gibanica",
            "description": "Prekmurska Gibanica is a layered pastry filled with poppy seeds, walnuts, apples, and cottage cheese, enjoyed for its rich and complex flavors."
        }
    },
    {
        "country": "Solomon Islands",
        "dishes": [
            {
                "name": "Poi",
                "description": "Poi is a fermented taro pudding, known for its smooth texture and slightly tangy flavor, reflecting the traditional culinary practices of the Solomon Islands."
            },
            {
                "name": "Fish in Coconut Milk",
                "description": "Fish in Coconut Milk is a dish where fish is cooked in a creamy coconut milk sauce, enhanced with local spices, offering a rich and savory taste."
            },
            {
                "name": "Palusami",
                "description": "Palusami is made from taro leaves cooked with coconut cream, often with added onions and meat, known for its creamy and savory flavor."
            }
        ],
        "dessert": {
            "name": "Banana Cake",
            "description": "Banana Cake is a beloved dessert in the Solomon Islands, characterized by its moist texture and sweet, banana flavor, often enjoyed during celebrations."
        }
    },
    {
        "country": "Somalia",
        "dishes": [
            {
                "name": "Bariis",
                "description": "Bariis is a spiced rice dish, often cooked with lamb or chicken, and flavored with a blend of Somali spices, known for its aromatic and savory taste."
            },
            {
                "name": "Suqaar",
                "description": "Suqaar is a stir-fried meat dish, typically made with beef or goat, mixed with vegetables and spices, celebrated for its hearty and flavorful profile."
            },
            {
                "name": "Maraq",
                "description": "Maraq is a meat and vegetable stew, enjoyed for its rich and comforting flavors, often served with rice or bread."
            }
        ],
        "dessert": {
            "name": "Halwa",
            "description": "Halwa is a sweet confection made from sugar, corn starch, and ghee, flavored with cardamom and sometimes nuts, known for its dense and rich taste."
        }
    },
    {
        "country": "South Africa",
        "dishes": [
            {
                "name": "Bobotie",
                "description": "Bobotie is a spiced meat bake, made with minced meat, dried fruits, and spices, topped with a savory custard, known for its unique blend of sweet and savory flavors."
            },
            {
                "name": "Biltong",
                "description": "Biltong is dried cured meat, similar to jerky, seasoned with vinegar and spices, enjoyed for its rich and chewy texture."
            },
            {
                "name": "Bunny Chow",
                "description": "Bunny Chow is a hollowed-out loaf of bread filled with curry, a street food favorite known for its flavorful and hearty filling."
            }
        ],
        "dessert": {
            "name": "Malva Pudding",
            "description": "Malva Pudding is a sweet sponge pudding made with apricot jam and a creamy sauce, known for its moist texture and rich flavor."
        }
    },
    {
        "country": "South Sudan",
        "dishes": [
            {
                "name": "Kisra",
                "description": "Kisra is a fermented bread made from sorghum or wheat, enjoyed for its slightly sour taste and soft texture, often served with stews."
            },
            {
                "name": "Ful Medames",
                "description": "Ful Medames is a stew made from fava beans, often seasoned with garlic, lemon, and olive oil, known for its hearty and savory flavor."
            },
            {
                "name": "Asida",
                "description": "Asida is a savory porridge made from wheat or sorghum flour, known for its smooth texture and mild taste, often served with stews or sauces."
            }
        ],
        "dessert": {
            "name": "Halawa Simsim",
            "description": "Kombo is a type of sweet dumpling, made from flour and sugar, known for its soft and sweet texture, often enjoyed as a dessert or snack."
        }
    },
    {
        "country": "Spain",
        "dishes": [
            {
                "name": "Paella",
                "description": "Paella is a rice dish cooked with seafood or meat, saffron, and vegetables, known for its vibrant colors and rich, savory flavors."
            },
            {
                "name": "Gazpacho",
                "description": "Gazpacho is a cold tomato soup made with blended tomatoes, peppers, cucumbers, and garlic, celebrated for its refreshing and tangy taste."
            },
            {
                "name": "Tortilla Española",
                "description": "Tortilla Española is a Spanish omelet made with eggs, potatoes, and onions, known for its simple yet delicious flavor."
            }
        ],
        "dessert": {
            "name": "Churros",
            "description": "Churros are fried dough pastries, often rolled in sugar and served with chocolate sauce, known for their crispy exterior and soft interior."
        }
    },
    {
        "country": "Sri Lanka",
        "dishes": [
            {
                "name": "Kottu Roti",
                "description": "Kottu Roti is a dish made from chopped flatbread stir-fried with vegetables, eggs, and meat, known for its flavorful and hearty taste."
            },
            {
                "name": "Fish Ambul Thiyal",
                "description": "Fish Ambul Thiyal is a sour fish curry made with dried goraka (a sour fruit), spices, and fish, celebrated for its tangy and spicy flavor."
            },
            {
                "name": "Dhal Curry",
                "description": "Dhal Curry is a lentil curry made with coconut milk, spices, and herbs, enjoyed for its creamy texture and savory taste."
            }
        ],
        "dessert": {
            "name": "Watalappan",
            "description": "Watalappan is a coconut custard pudding made with coconut milk, jaggery, and spices, known for its rich and aromatic flavor."
        }
    },
    {
        "country": "Sudan",
        "dishes": [
            {
                "name": "Ful Medames",
                "description": "Ful Medames is a traditional dish of stewed fava beans, flavored with cumin, garlic, and lemon juice, enjoyed for its hearty and savory taste."
            },
            {
                "name": "Asida",
                "description": "Asida is a savory porridge made from wheat or sorghum flour, known for its smooth texture and mild taste, often served with stews."
            },
            {
                "name": "Kisra",
                "description": "Kisra is a fermented bread made from sorghum, known for its slightly sour taste and soft texture, often served with various stews."
            }
        ],
        "dessert": {
            "name": "Basbousa",
            "description": "Basbousa is a semolina cake soaked in syrup, often flavored with rose water or orange blossom, known for its moist texture and sweet, aromatic flavor."
        }
    },
    {
        "country": "Suriname",
        "dishes": [
            {
                "name": "Pom",
                "description": "Pom is a casserole made with chicken and root vegetables like taro or cassava, flavored with citrus juice and spices, known for its hearty and savory taste."
            },
            {
                "name": "Roti",
                "description": "Roti is a flatbread often served with curried meat and vegetables, known for its soft texture and delicious fillings."
            },
            {
                "name": "Saoto Soup",
                "description": "Saoto Soup is a chicken soup made with glass noodles, bean sprouts, and spices, celebrated for its flavorful and comforting taste."
            }
        ],
        "dessert": {
            "name": "Bojo Cake",
            "description": "Bojo Cake is a cassava and coconut cake, often flavored with vanilla and spices, known for its moist texture and rich, sweet flavor."
        }
    },
    {
        "country": "Sweden",
        "dishes": [
            {
                "name": "Köttbullar",
                "description": "Köttbullar are Swedish meatballs made from a mix of beef and pork, seasoned with spices and served with gravy, mashed potatoes, and lingonberry jam, known for their rich and savory taste."
            },
            {
                "name": "Gravlax",
                "description": "Gravlax is cured salmon, seasoned with dill and sugar, often served with mustard sauce, known for its delicate and flavorful taste."
            },
            {
                "name": "Janssons Frestelse",
                "description": "Janssons Frestelse is a casserole made with potatoes, anchovies, and onions, baked in cream, known for its rich and savory flavor."
            }
        ],
        "dessert": {
            "name": "Prinsesstårta",
            "description": "Prinsesstårta is a princess cake made with layers of sponge cake, pastry cream, and whipped cream, covered with marzipan, known for its light and sweet taste."
        }
    },
    {
        "country": "Switzerland",
        "dishes": [
            {
                "name": "Fondue",
                "description": "Fondue is a dish of melted cheese, often flavored with wine and garlic, served with bread for dipping, known for its rich and creamy flavor."
            },
            {
                "name": "Rösti",
                "description": "Rösti is a potato pancake, often fried until crispy, known for its simple yet delicious taste, often served as a side dish."
            },
            {
                "name": "Zürcher Geschnetzeltes",
                "description": "Zürcher Geschnetzeltes is a dish of veal in a creamy white wine and mushroom sauce, known for its rich and savory flavor."
            }
        ],
        "dessert": {
            "name": "Toblerone Mousse",
            "description": "Toblerone Mousse is a dessert made from Toblerone chocolate, whipped cream, and eggs, known for its smooth and rich chocolate flavor."
        }
    },
    {
        "country": "Syria",
        "dishes": [
            {
                "name": "Kibbeh",
                "description": "Kibbeh is made from ground meat and bulgur wheat, often shaped into patties or balls and fried or baked, known for its savory and spiced flavor."
            },
            {
                "name": "Fattoush",
                "description": "Fattoush is a bread salad made with toasted or fried pieces of pita bread, mixed with fresh vegetables and herbs, dressed with a tangy sumac vinaigrette."
            },
            {
                "name": "Shawarma",
                "description": "Shawarma is marinated meat, often lamb or chicken, cooked on a vertical rotisserie, known for its tender and flavorful taste, typically served in a wrap or pita."
            }
        ],
        "dessert": {
            "name": "Baklava",
            "description": "Baklava is a sweet filo pastry filled with nuts and soaked in syrup or honey, known for its rich and sweet flavor."
        }
    },
    {
        "country": "Taiwan",
        "dishes": [
            {
                "name": "Beef Noodle Soup",
                "description": "Beef Noodle Soup is a traditional Taiwanese dish made with braised beef, beef broth, and wheat noodles, known for its rich and savory flavor."
            },
            {
                "name": "Xiao Long Bao",
                "description": "Xiao Long Bao are soup dumplings filled with minced pork and gelatinized broth, which liquefies upon steaming, known for their juicy and flavorful taste."
            },
            {
                "name": "Lu Rou Fan",
                "description": "Lu Rou Fan is a dish of braised pork served over rice, known for its savory and slightly sweet flavor, often garnished with pickled vegetables."
            }
        ],
        "dessert": {
            "name": "Pineapple Cake",
            "description": "Pineapple Cake is a traditional Taiwanese pastry with a sweet and tangy pineapple filling, known for its crumbly texture and delightful flavor."
        }
    },
    {
        "country": "Tajikistan",
        "dishes": [
            {
                "name": "Plov",
                "description": "Plov is a rice pilaf made with meat, carrots, onions, and spices, known for its hearty and aromatic flavor."
            },
            {
                "name": "Shurbo",
                "description": "Shurbo is a meat and vegetable soup, often made with lamb or beef, potatoes, carrots, and herbs, celebrated for its rich and comforting taste."
            },
            {
                "name": "Qurutob",
                "description": "Qurutob is a dish made with flatbread soaked in yogurt and topped with sautéed vegetables and herbs, known for its tangy and savory flavor."
            }
        ],
        "dessert": {
            "name": "Halvaitar",
            "description": "Halvaitar is a sweet milk dessert, often flavored with cardamom and nuts, known for its creamy and rich taste."
        }
    },
    {
        "country": "Tanzania",
        "dishes": [
            {
                "name": "Ugali",
                "description": "Ugali is a maize porridge, often served as a side dish with stews or vegetables, known for its firm and smooth texture."
            },
            {
                "name": "Nyama Choma",
                "description": "Nyama Choma is grilled meat, usually beef or goat, marinated with spices, and known for its smoky and savory flavor."
            },
            {
                "name": "Pilau",
                "description": "Pilau is a spiced rice dish, often cooked with meat, vegetables, and a blend of spices, celebrated for its aromatic and flavorful taste."
            }
        ],
        "dessert": {
            "name": "Mandazi",
            "description": "Mandazi are fried doughnuts, often flavored with coconut milk and cardamom, known for their slightly sweet and fluffy texture."
        }
    },
    {
        "country": "Thailand",
        "dishes": [
            {
                "name": "Pad Thai",
                "description": "Pad Thai is a stir-fried noodle dish made with rice noodles, shrimp or chicken, peanuts, bean sprouts, and eggs, known for its sweet and savory flavor."
            },
            {
                "name": "Tom Yum Goong",
                "description": "Tom Yum Goong is a spicy shrimp soup made with lemongrass, kaffir lime leaves, galangal, and chilies, celebrated for its hot and sour taste."
            },
            {
                "name": "Green Curry",
                "description": "Green Curry is a spicy and aromatic curry made with coconut milk, green curry paste, and vegetables or meat, known for its vibrant and rich flavor."
            }
        ],
        "dessert": {
            "name": "Mango Sticky Rice",
            "description": "Mango Sticky Rice is a dessert made with glutinous rice, fresh mango slices, and coconut milk, known for its sweet and creamy taste."
        }
    },
    {
        "country": "Togo",
        "dishes": [
            {
                "name": "Fufu",
                "description": "Fufu is a dish made from pounded yam or cassava, known for its smooth and doughy texture, often served with soups or stews."
            },
            {
                "name": "Akpan",
                "description": "Akpan is a porridge made from fermented corn and cassava, celebrated for its tangy and slightly sour flavor."
            },
            {
                "name": "Gboma Dessi",
                "description": "Gboma Dessi is a spinach stew cooked with tomatoes, onions, and sometimes meat, known for its savory and hearty flavor."
            }
        ],
        "dessert": {
            "name": "Koko",
            "description": "Koko is a sweet millet porridge, often flavored with ginger and sugar, known for its smooth and creamy texture."
        }
    },
    {
        "country": "Tonga",
        "dishes": [
            {
                "name": "Lu Pulu",
                "description": "Lu Pulu is a dish of corned beef mixed with coconut milk, wrapped in taro leaves, and baked, known for its rich and savory flavor."
            },
            {
                "name": "Ota Ika",
                "description": "Ota Ika is marinated raw fish mixed with coconut milk, onions, and lime juice, celebrated for its fresh and tangy taste."
            },
            {
                "name": "Kapisi Pulu",
                "description": "Kapisi Pulu is a dish of cabbage cooked with coconut cream and sometimes meat, known for its creamy and mild flavor."
            }
        ],
        "dessert": {
            "name": "Faikakai Topai",
            "description": "Faikakai Topai are dumplings served with coconut syrup, known for their sweet and tender texture."
        }
    },
    {
        "country": "Trinidad and Tobago",
        "dishes": [
            {
                "name": "Doubles",
                "description": "Doubles are a street food consisting of curried chickpeas sandwiched between two pieces of flatbread, known for their spicy and savory flavor."
            },
            {
                "name": "Callaloo",
                "description": "Callaloo is a leafy green soup made with dasheen leaves, okra, and sometimes crab or salted meat, celebrated for its rich and earthy taste."
            },
            {
                "name": "Pelau",
                "description": "Pelau is a one-pot dish of rice, pigeon peas, and meat, often flavored with coconut milk and spices, known for its hearty and flavorful taste."
            }
        ],
        "dessert": {
            "name": "Coconut Bake",
            "description": "Coconut Bake is a type of bread made with grated coconut, known for its soft texture and slightly sweet flavor."
        }
    },
    {
        "country": "Tunisia",
        "dishes": [
            {
                "name": "Couscous",
                "description": "Couscous is steamed semolina served with meat and vegetables, known for its light and fluffy texture and ability to absorb the flavors of its accompanying stew."
            },
            {
                "name": "Brik",
                "description": "Brik is a fried pastry filled with egg, tuna, and capers, celebrated for its crispy exterior and savory filling."
            },
            {
                "name": "Harissa",
                "description": "Harissa is a spicy chili paste made from smoked chili peppers, garlic, and olive oil, known for its bold and fiery flavor."
            }
        ],
        "dessert": {
            "name": "Makroud",
            "description": "Makroud is a semolina cake filled with dates and sometimes nuts, often soaked in honey or syrup, known for its rich and sweet flavor."
        }
    },
    {
        "country": "Turkey",
        "dishes": [
            {
                "name": "Kebab",
                "description": "Kebab is grilled or skewered meat, often marinated and cooked over an open flame, known for its smoky and savory flavor."
            },
            {
                "name": "Dolma",
                "description": "Dolma are grape leaves stuffed with rice, herbs, and sometimes meat, celebrated for their tangy and aromatic taste."
            },
            {
                "name": "Manti",
                "description": "Manti are dumplings filled with spiced meat, often served with a garlic yogurt sauce, known for their tender texture and flavorful filling."
            }
        ],
        "dessert": {
            "name": "Baklava",
            "description": "Baklava is a sweet pastry made from layers of filo dough, filled with nuts, and soaked in syrup or honey, known for its rich and sweet flavor."
        }
    },
    {
        "country": "Turkmenistan",
        "dishes": [
            {
                "name": "Plov",
                "description": "Plov is a rice pilaf made with meat, carrots, and onions, known for its hearty and aromatic flavor."
            },
            {
                "name": "Ichlekli",
                "description": "Ichlekli is a meat pie made with a flaky crust and filled with seasoned meat and onions, celebrated for its savory and satisfying taste."
            },
            {
                "name": "Shashlik",
                "description": "Shashlik are grilled meat skewers, often marinated in a blend of spices and cooked over an open flame, known for their smoky and savory flavor."
            }
        ],
        "dessert": {
            "name": "Pakhlava",
            "description": "Pakhlava is a type of baklava, made with layers of filo dough, nuts, and syrup, known for its rich and sweet flavor."
        }
    },
    {
        "country": "Tuvalu",
        "dishes": [
            {
                "name": "Coconut Crab",
                "description": "Coconut Crab is a delicacy, often cooked with coconut milk, known for its rich and unique flavor."
            },
            {
                "name": "Palusami",
                "description": "Palusami is a dish made with taro leaves and coconut cream, often baked until tender, celebrated for its creamy and savory taste."
            },
            {
                "name": "Pulaka",
                "description": "Pulaka is a type of swamp taro, often boiled or baked, known for its starchy and mild flavor."
            }
        ],
        "dessert": {
            "name": "Banana Fritters",
            "description": "Banana Fritters are made by frying banana slices in a light batter, known for their sweet and crispy texture."
        }
    },
    {
        "country": "Uganda",
        "dishes": [
            {
                "name": "Matoke",
                "description": "Matoke is a dish made from cooked bananas, often mashed and served with a sauce, known for its smooth texture and mild flavor."
            },
            {
                "name": "Luwombo",
                "description": "Luwombo is a stew made with meat or fish, wrapped in banana leaves and steamed, celebrated for its rich and aromatic taste."
            },
            {
                "name": "Posho",
                "description": "Posho is a maize porridge, often served as a side dish with stews or vegetables, known for its firm and smooth texture."
            }
        ],
        "dessert": {
            "name": "Mandazi",
            "description": "Mandazi are fried doughnuts, often flavored with coconut milk and cardamom, known for their slightly sweet and fluffy texture."
        }
    },
    {
        "country": "Ukraine",
        "dishes": [
            {
                "name": "Borscht",
                "description": "Borscht is a beet soup, often made with beef or pork, cabbage, and potatoes, known for its vibrant color and hearty flavor."
            },
            {
                "name": "Varenyky",
                "description": "Varenyky are dumplings filled with potatoes, cheese, or meat, celebrated for their tender texture and savory taste."
            },
            {
                "name": "Holubtsi",
                "description": "Holubtsi are stuffed cabbage rolls filled with rice and meat, often cooked in tomato sauce, known for their rich and comforting flavor."
            }
        ],
        "dessert": {
            "name": "Syrniki",
            "description": "Syrniki are cheese pancakes, often served with sour cream or jam, known for their soft texture and sweet taste."
        }
    },
    {
        "country": "United Arab Emirates",
        "dishes": [
            {
                "name": "Al Harees",
                "description": "Al Harees is a wheat and meat porridge, slow-cooked until creamy, known for its rich and comforting flavor."
            },
            {
                "name": "Shawarma",
                "description": "Shawarma is marinated meat, often cooked on a vertical rotisserie and served in a wrap or pita, celebrated for its tender and flavorful taste."
            },
            {
                "name": "Machboos",
                "description": "Machboos is a spiced rice dish made with meat, often flavored with a blend of local spices, known for its aromatic and savory taste."
            }
        ],
        "dessert": {
            "name": "Luqaimat",
            "description": "Luqaimat are sweet dumplings, often drizzled with date syrup, known for their soft texture and sweet flavor."
        }
    },
    {
        "country": "United Kingdom",
        "dishes": [
            {
                "name": "Fish and Chips",
                "description": "Fish and Chips is a classic British dish consisting of battered and fried fish served with thick-cut potato fries, known for its crispy texture and savory taste."
            },
            {
                "name": "Shepherd's Pie",
                "description": "Shepherd's Pie is a meat and vegetable pie topped with mashed potatoes, baked until golden, celebrated for its hearty and comforting flavor."
            },
            {
                "name": "Roast Beef and Yorkshire Pudding",
                "description": "Roast Beef and Yorkshire Pudding is a traditional Sunday roast, featuring succulent roast beef and crispy Yorkshire puddings, known for its rich and savory taste."
            }
        ],
        "dessert": {
            "name": "Sticky Toffee Pudding",
            "description": "Sticky Toffee Pudding is a moist sponge cake made with dates, covered in a rich toffee sauce, known for its sweet and indulgent flavor."
        }
    },
    {
        "country": "United States",
        "dishes": [
            {
                "name": "Hamburger",
                "description": "Hamburger is a sandwich consisting of a ground beef patty served in a bun, often topped with lettuce, tomato, and various condiments, known for its juicy and savory flavor."
            },
            {
                "name": "Barbecue Ribs",
                "description": "Barbecue Ribs are pork or beef ribs, slow-cooked and basted with a tangy barbecue sauce, known for their tender and smoky taste."
            },
            {
                "name": "Fried Chicken",
                "description": "Fried Chicken is chicken coated in seasoned flour and deep-fried until crispy, celebrated for its crunchy exterior and juicy meat."
            }
        ],
        "dessert": {
            "name": "Apple Pie",
            "description": "Apple Pie is a classic American dessert made with a buttery crust and filled with spiced apples, known for its sweet and comforting flavor."
        }
    },
    {
        "country": "Uruguay",
        "dishes": [
            {
                "name": "Asado",
                "description": "Asado is a barbecue featuring various cuts of meat cooked over an open flame, known for its rich and smoky flavor."
            },
            {
                "name": "Chivito",
                "description": "Chivito is a steak sandwich often served with ham, cheese, lettuce, tomato, and mayonnaise, celebrated for its hearty and savory taste."
            },
            {
                "name": "Empanadas",
                "description": "Empanadas are pastry turnovers filled with meat, cheese, or vegetables, known for their flaky crust and flavorful fillings."
            }
        ],
        "dessert": {
            "name": "Dulce de Leche",
            "description": "Dulce de Leche is a caramel spread made from sweetened milk, known for its rich and creamy flavor, often used in various desserts."
        }
    },
    {
        "country": "Uzbekistan",
        "dishes": [
            {
                "name": "Plov",
                "description": "Plov is a rice pilaf made with meat, carrots, and onions, known for its hearty and aromatic flavor."
            },
            {
                "name": "Shashlik",
                "description": "Shashlik are grilled meat skewers, often marinated in a blend of spices and cooked over an open flame, known for their smoky and savory flavor."
            },
            {
                "name": "Lagman",
                "description": "Lagman is a noodle soup made with meat, vegetables, and a flavorful broth, celebrated for its rich and comforting taste."
            }
        ],
        "dessert": {
            "name": "Chak-Chak",
            "description": "Chak-Chak is a dessert made from fried dough pieces coated in honey, known for its sweet and crunchy texture."
        }
    },
    {
        "country": "Vanuatu",
        "dishes": [
            {
                "name": "Lap Lap",
                "description": "Lap Lap is a pudding made from grated root vegetables like taro or yam, mixed with coconut milk, and baked, known for its hearty and savory flavor."
            },
            {
                "name": "Tuluk",
                "description": "Tuluk is a dish made from stuffed taro leaves, often filled with coconut cream and meat, celebrated for its rich and tender taste."
            },
            {
                "name": "Coconut Crab",
                "description": "Coconut Crab is a delicacy often cooked with coconut milk, known for its unique and rich flavor."
            }
        ],
        "dessert": {
            "name": "Simboro",
            "description": "Simboro are banana dumplings cooked in coconut milk, known for their sweet and creamy flavor."
        }
    },
    {
        "country": "Venezuela",
        "dishes": [
            {
                "name": "Arepas",
                "description": "Arepas are corn cakes, often filled with cheese, meats, or avocado, known for their versatile and delicious taste."
            },
            {
                "name": "Pabellón Criollo",
                "description": "Pabellón Criollo is a dish of shredded beef, rice, black beans, and fried plantains, celebrated for its hearty and flavorful combination."
            },
            {
                "name": "Cachapas",
                "description": "Cachapas are corn pancakes, often filled with cheese, known for their sweet and savory flavor."
            }
        ],
        "dessert": {
            "name": "Tres Leches Cake",
            "description": "Tres Leches Cake is a sponge cake soaked in three kinds of milk, known for its moist texture and rich flavor."
        }
    },
    {
        "country": "Vietnam",
        "dishes": [
            {
                "name": "Pho",
                "description": "Pho is a noodle soup made with beef or chicken, flavored with herbs and spices, known for its aromatic and savory broth."
            },
            {
                "name": "Banh Mi",
                "description": "Banh Mi is a Vietnamese sandwich made with a baguette, filled with meats, pickled vegetables, and fresh herbs, celebrated for its crunchy and flavorful taste."
            },
            {
                "name": "Bun Cha",
                "description": "Bun Cha is a dish of grilled pork served with noodles, fresh herbs, and a tangy dipping sauce, known for its savory and refreshing flavor."
            }
        ],
        "dessert": {
            "name": "Che",
            "description": "Che is a sweet soup or pudding made with a variety of ingredients like beans, fruits, and coconut milk, known for its rich and diverse flavors."
        }
    },
    {
        "country": "Yemen",
        "dishes": [
            {
                "name": "Mandi",
                "description": "Mandi is a spiced rice dish cooked with meat, often lamb or chicken, known for its aromatic and flavorful taste."
            },
            {
                "name": "Saltah",
                "description": "Saltah is a stew made with meat, vegetables, and hilbeh (fenugreek foam), celebrated for its hearty and savory flavor."
            },
            {
                "name": "Bint Al-Sahn",
                "description": "Bint Al-Sahn is a honey cake made with thin layers of dough, butter, and honey, known for its sweet and buttery taste."
            }
        ],
        "dessert": {
            "name": "Masoub",
            "description": "Masoub is a banana bread pudding made with overripe bananas, bread, and cream, known for its rich and sweet flavor."
        }
    },
    {
        "country": "Zambia",
        "dishes": [
            {
                "name": "Nshima",
                "description": "Nshima is a maize porridge, often served as a side dish with stews or vegetables, known for its firm and smooth texture."
            },
            {
                "name": "Ifisashi",
                "description": "Ifisashi is a dish of vegetables cooked in a peanut sauce, celebrated for its rich and savory flavor."
            },
            {
                "name": "Chikanda",
                "description": "Chikanda is a dish made from ground orchid tuber and peanuts, often referred to as African polony, known for its unique and earthy taste."
            }
        ],
        "dessert": {
            "name": "Vitumbuwa",
            "description": "Vitumbuwa are fried doughnuts, often enjoyed as a snack or dessert, known for their sweet and fluffy texture."
        }
    },
    {
        "country": "Zimbabwe",
        "dishes": [
            {
                "name": "Sadza",
                "description": "Sadza is a maize porridge, often served as a side dish with stews or vegetables, known for its firm and smooth texture."
            },
            {
                "name": "Nyama",
                "description": "Nyama is a meat stew, often made with beef or goat, celebrated for its hearty and savory flavor."
            },
            {
                "name": "Muriwo Unedovi",
                "description": "Muriwo Unedovi is a dish of leafy greens cooked with peanut butter, known for its rich and nutty taste."
            }
        ],
        "dessert": {
            "name": "Mapopo",
            "description": "Mapopo is a papaya candy, often enjoyed as a sweet treat, known for its chewy texture and fruity flavor."
        }
    }
]